[
  {
    "question": "A skilled tailor is making a ceremonial robe for a grand festival. The robe requires 6 bolts of blue fiber and half that much white fiber. How many bolts in total does it take to complete the robe?",
    "gold_num": "9"
  },
  {
    "question": "James is training for a big race and decides to run 5 sprints 4 times a week. He runs 80 meters each sprint. How many total meters does he run in a week?",
    "gold_num": "1600"
  },
  {
    "question": "Toulouse has twice as many sheep as Charleston. Charleston has 5 times as many sheep as Seattle. How many sheep do Toulouse, Charleston, and Seattle have together if Seattle has 30 sheep?",
    "gold_num": "420"
  },
  {
    "question": "A merchant is considering two purchase plans: jewelry worth $10,000 or electronic gadgets worth $15,000. His financial advisor predicts the jewelry market will go up 3% while the electronic gadgets market will rise 1.5% within the same month. If the merchant wants to maximize profit at the end of this month, how much profit would this be?",
    "gold_num": "300"
  },
  {
    "question": "Two trains leave San Rafael at the same time. They begin traveling westward, both traveling for 120 miles. The next day, they travel northwards, covering 200 miles. What's the distance covered by each train in the two days?",
    "gold_num": "320"
  },
  {
    "question": "John takes care of 14 dogs. Each dog takes 0.75 hours a day to walk and take care of their business. How many hours a week does he spend taking care of the dogs?",
    "gold_num": "73.5"
  },
  {
    "question": "Mike enjoys playing ping pong and plays for 60 minutes. In the first 30 minutes, he scores 8 points. In the second 30 minutes, he scores 50% more points. How many total points did he score?",
    "gold_num": "20"
  },
  {
    "question": "John has decided to clear out his entire toy collection to fund his new hobby of video gaming. He owns 18 lego sets and sells them for $25 each. Afterward, he buys 12 video games for $30 each and is left with $10. How many lego sets does John still have after these transactions?",
    "gold_num": "2"
  },
  {
    "question": "Tracy is working on a big gardening project and needs to support her tomato plants with wire. She uses a piece of wire that is 10 feet long. She cuts the wire into pieces that are each 10 inches long. How many pieces does she obtain from the entire wire?",
    "gold_num": "12"
  },
  {
    "question": "Richard lives in a tall apartment building with 20 floors. Each floor contains 10 units, and 2/3 of the building is occupied. What is the total number of unoccupied units in the building?",
    "gold_num": "67"
  },
  {
    "question": "Jean has a sweet tooth and starts with 50 lollipops. Jean eats 4 of the lollipops. With the remaining lollipops, Jean wants to package 3 lollipops in each bag. How many bags can Jean fill?",
    "gold_num": "15"
  },
  {
    "question": "Janet wants to give her daughter a special gift and buys a brooch. She pays $800 for the materials and then another $1200 for the jeweler to construct it. After that, she pays 15% of that total to get it insured. How much did Janet pay in total?",
    "gold_num": "2300"
  },
  {
    "question": "Tommy is hosting a fundraising event for his charity and is selling brownies for $5 a slice and cheesecakes for $7 a slice. If Tommy sells 60 brownies and 35 slices of cheesecake, how much money does Tommy raise altogether?",
    "gold_num": "545"
  },
  {
    "question": "If Raymond does half as much laundry as Sarah, and Sarah does 6 times as much laundry as David, calculate the difference in the amount of laundry Raymond and David do if Sarah does 600 pounds of laundry.",
    "gold_num": "200"
  },
  {
    "question": "John adopts a dog and takes it to the groomer, which costs $150. The groomer offers him a 40% discount for being a new customer. How much does the grooming cost after the discount?",
    "gold_num": "90"
  },
  {
    "question": "Dan loves roses and decides to plant 5 rose bushes. Each rose bush has 30 roses, and each rose has 10 thorns. How many thorns are there in total across all the bushes?",
    "gold_num": "1500"
  },
  {
    "question": "Gene is embarking on a new quilt project that showcases his travel memories. He decides to use one souvenir t-shirt from each vacation as a quilt block. Each row of the quilt represents a year of his travels. He goes on five vacations a year and has been vacationing since he was 20 years old. He is now 36. How many quilt blocks does he have in total? Think about how this number reflects his years of exploration.",
    "gold_num": "80"
  },
  {
    "question": "Greg relies on his alarm as a punctual reminder throughout the day. He has set it to ring four times a day, ensuring he stays on schedule. When the alarm goes off, it continues to ring until Greg turns it off. The first time it rang today, it lasted six rings. The second time, it rang for three times as many rings as the first. The third time, it rang for half as many rings as the second. The fourth time, it rang for twice as many rings as the third. How many times did the alarm ring in all? Consider how each interval builds on the previous one.",
    "gold_num": "51"
  },
  {
    "question": "Marilyn and Harald are comparing the success of their debut records. Marilyn's first release sold twelve times as many copies as Harald's. Together, they sold 156,000 copies. How many copies did Harald sell? Reflect on how changing the ratio would affect each artist’s contribution to the total.",
    "gold_num": "12000"
  },
  {
    "question": "Jan, Marcia, and Cindy are discussing pets and how their counts compare. Jan has four times the number of pets as Marcia. Marcia has three more pets than Cindy. If Cindy has six pets, how many total pets do the three have? Think about how each person’s count depends on Cindy’s number.",
    "gold_num": "51"
  },
  {
    "question": "Ms. Rivera’s fifth-grade class consists of 360 students, and she is analyzing the gender distribution. Out of these students, 2/5 are boys and 3/4 of the girls participate in the girl scouts. How many girls are not in the girl scouts? Consider the impact of changing the total class size.",
    "gold_num": "54"
  },
  {
    "question": "Harry values tracking his sleep patterns to improve his health. Last night, he slept for 15 hours. His friend James slept only 2/3 of what Harry slept. How many more hours did Harry sleep than James? Reflect on how sleep differences can vary between individuals.",
    "gold_num": "5"
  },
  {
    "question": "A dense fog bank often moves in from the ocean to cover the city at dusk. It takes 12 minutes to cover every 4 miles of the city. If the city is 64 miles across from the oceanfront to the inland edge, how many minutes will it take for the fog bank to cover the whole city? Think about how the coverage time scales with distance.",
    "gold_num": "192"
  },
  {
    "question": "Poppy enjoys tackling large puzzles on rainy days. She is working on a 2400-piece jigsaw puzzle and wants to track her progress. She places a quarter of the pieces on the board, and then her mom places a third of the remaining pieces. How many jigsaw pieces are left to be placed? Consider how dividing the pieces in stages affects the remaining count.",
    "gold_num": "1200"
  },
  {
    "question": "Cody and Amir have a friendly competition to see who can eat more cookies at their weekend bake sale. Cody eats five times as many cookies as Amir eats. If Amir eats 10 cookies, how many cookies do both of them eat together? Think about how multiplying Amir’s count determines their combined total.",
    "gold_num": "60"
  },
  {
    "question": "The art classroom’s whiteboard is shared among six teachers who each teach three lessons per day and use the whiteboard in every session. If the whiteboard is cleaned four times during each lesson, how many times is it cleaned in a single day? Reflect on how increasing lessons or teachers changes the total cleanings.",
    "gold_num": "72"
  },
  {
    "question": "Ryan is passionate about gardening and enjoys adding new flowers to his garden every day. Suppose Ryan plants 7 flowers a day in his garden. After 28 days, how many flowers does he have if 10 did not grow? Consider only the flowers that successfully grew.",
    "gold_num": "186"
  },
  {
    "question": "John has a big family and wants to buy new shoes for his children. He decides to buy 5 pairs of shoes for each of his 6 children. They cost $80 each. How much did he pay in total for all the shoes?",
    "gold_num": "2400"
  },
  {
    "question": "A customs officer at the main port of SeaSide clearances counted 6 containers of imported vehicles, each having 8 vehicles inside. The next day, more containers were brought in, and the total number of vehicles at the port became 80. Calculate the number of containers that were imported on the second day, assuming all the containers contain 8 vehicles.",
    "gold_num": "4"
  },
  {
    "question": "Miguel is preparing for an art competition and uses a lot of paper for his drawings. He uses 5 pads of paper a week for his drawing. If there are 40 sheets of paper on a pad of paper, how many sheets of paper does he use every month (assuming 4 weeks in a month)?",
    "gold_num": "800"
  },
  {
    "question": "Nissa is organizing a large holiday event and hires 90 seasonal workers to play elves in her department store's Santa village. Half of the elves quit after children vomit on them, then 20 of the remaining elves quit after kids kick their shins. How many elves are left to help with the event?",
    "gold_num": "25"
  },
  {
    "question": "On Monday, Walt walked 8 miles as part of his new fitness routine. On Tuesday, he walked 7 times as many miles as he walked on Monday. His total mileage Monday through Wednesday was 80 miles. How many miles did he walk on Wednesday?",
    "gold_num": "16"
  },
  {
    "question": "Tom is meticulous about keeping his car clean and gets 6 car washes a month. If each car wash costs $20, how much does he pay in a year for car washes?",
    "gold_num": "1440"
  },
  {
    "question": "There are 36 unicorns left in the world. Half of them are in the Scottish Highlands. Two thirds of the Scottish unicorns are female. How many female Scottish unicorns are there?",
    "gold_num": "12"
  },
  {
    "question": "In a candy machine, there are 30 more than five times the number of pink gumballs as there are blue gumballs. If there are 14 blue gumballs, how many pink ones are there?",
    "gold_num": "100"
  },
  {
    "question": "Of the 40 available cars for rent, 18 are automatic cars, 12 are manual cars, and the rest are semi-automatic. What percentage of the cars are semi-automatic?",
    "gold_num": "25"
  },
 {
    "question": "Jordan has been trying to balance his leisure activities with his financial goals. He often wonders how much extra money he could make if he spent less time gaming and more time working. Jordan plays video games for 3 hours every day. He also has a part-time job where he earns $12 an hour. How much money would Jordan earn in one week if he spent his video game time working instead? Consider how the additional earnings might help him save for future expenses.",
    "gold_num": "252"
  },
  {
    "question": "John is exploring ways to maximize his agricultural yield and increase his profitability. He has a large pineapple plantation that he tends with great care. John has 15 hectares of a pineapple field. There are 150 pineapples per hectare. John can harvest his pineapples every 4 months. How many pineapples can John harvest within a year? Reflect on how improving yield per hectare could impact his overall production.",
    "gold_num": "6750"
  },
  {
    "question": "Charlie and his friends are discussing their social media networks and how their following compares. They are curious about how their friend counts differ. Charlie has three times as many Facebook friends as Dorothy. James has four times as many friends on Facebook as Dorothy. If Charlie has 18 friends on Facebook, how many Facebook friends does James have? Think about how changing Dorothy’s base count affects everyone’s totals.",
    "gold_num": "24"
  },
  {
    "question": "Carl is planning a neighborhood bake sale and wants to budget his spending accurately. He decides to buy multiple packs of cookies for the event. Carl buys twelve packs of cookies. Each pack of cookies has eight cookies inside. Each cookie costs $0.25. How much change does Carl receive if he pays with a $50 bill? Consider if he had used a different bill denomination and how that would change the result.",
    "gold_num": "26"
  },
  {
    "question": "Raphael is budgeting for his upcoming school semester and wants to track his expenses carefully. He visits a store to purchase necessary supplies. Raphael went to buy some school supplies. He bought 6 pens which cost $2 each, 3 notebooks which cost $5 each, and a rim of bond paper which cost $25. How much did Raphael spend on everything? Imagine how this total compares to his initial budget and whether he needs to adjust his spending.",
    "gold_num": "52"
  },
  {
    "question": "Sandra volunteered to help with a school fundraiser and needs a steady supply of eggs for her dessert recipes. She plans her babysitting schedule accordingly. Sandra's neighbor gives her a basket of 12 eggs every time she babysits their daughter. To make a Spanish flan, she needs 4 eggs. If Sandra has been tasked to make 20 Spanish flans for her school fundraiser, how many times does Sandra have to babysit? Evaluate whether she can complete the task within her available timeframe.",
    "gold_num": "7"
  },
  {
    "question": "The school marching band is updating their appearance and budgeting for new uniforms. They want to know the total cost per set. The marching band is ordering new uniforms. Each uniform comes with a hat that costs $30, a jacket that costs three times as much as the hat, and pants that cost the average of the costs of the hat and jacket. How much does each uniform cost total? Consider how changes in the hat’s price would affect the overall cost structure.",
    "gold_num": "180"
  },
  {
    "question": "Lloyd is tracking his earnings from tutoring to see if he can cover his monthly expenses. He reviews his work log for the past two weeks. Lloyd earns $12 an hour on Math tutoring. He tutored 6 hours for the first week and 10 hours for the second week. How much did he earn for the first two weeks? Think about how additional hours would impact his total income.",
    "gold_num": "192"
  },
  {
    "question": "Two candidates are running for class representative at Sarai's school, and the class is eager to see the vote distribution. The students are counting each vote carefully. If the winner got 3/4 of the votes and the total number of students who voted in the class was 120, calculate the number of votes the loser got. Reflect on how increasing the class size would change the vote margins.",
    "gold_num": "30"
  },
  {
    "question": "Jenna and her mother enjoy spending weekends together picking fresh apples from their family farm. They measure their harvest to ensure fairness. Jenna and her mother picked some apples from their apple farm. Jenna picked half as many apples as her mom. If her mom got 30 apples, how many apples did they both pick? Consider how the total would change if Jenna picked a different fraction of her mom’s count.",
    "gold_num": "45"
  },
  {
    "question": "On a clear summer afternoon, three lifelong friends decided to enjoy a day at the county fair together. They discussed their budget and planned in advance how to split expenses fairly. Three friends spent $60 on 4 tickets to the fair. They also spent $6 less on food than on the tickets. They also went on 3 different rides which cost $45 for each ride. If they agreed to split all the costs evenly, how much did each of them pay? After the fair, they promised to meet monthly to try new adventures and keep their bond strong.",
    "gold_num": "83"
  },
  {
    "question": "At a quiet nature reserve, park rangers studied ducks as part of a wildlife conservation project. They recorded how much food the ducks consumed each week to ensure their health. Ducks need to eat 5 pounds of insects each week to survive. If there is a flock of 14 ducks, how many pounds of insects do they need per day? The rangers plan to use this data for upcoming feeding schedules.",
    "gold_num": "10"
  },
  {
    "question": "Sue's front yard became the center of a playful neighborhood prank over a weekend. The neighbors couldn't wait to surprise her with their colorful decorations. On Friday morning, the neighbors placed 36 pink plastic flamingos out on Sue's front yard. On Saturday morning, the neighbors took back one half of the flamingos, painted them white, and put these newly painted white flamingos back out on Sue's front yard. Then, on Sunday morning, they added another 36 pink plastic flamingos to the collection. At noon on Sunday, how many more pink plastic flamingos were out than white plastic flamingos? Sue laughed heartily at the final display and invited everyone for lemonade.",
    "gold_num": "36"
  },
  {
    "question": "Rose's weekly routine always included visits to three local bakeries to sample their specialty cakes. She kept track of her purchases in a colorful notebook. Rose went to the store on Monday and bought 6 cakes. Tuesday she went to a different store and bought four times that number of cakes. On Wednesday she went to another store and bought six times the number of cakes she did on Tuesday. How many cakes did she buy after all three days? By the end of the week, she planned to donate any leftovers to a local shelter.",
    "gold_num": "174"
  },
  {
    "question": "Sara set a savings goal to treat herself after completing her summer projects. She mapped out every dollar she needed carefully. Sara wants to buy herself a new jacket and 3 pairs of shoes. The jacket she wants costs $60 and each pair of shoes costs $40. Sara babysits the neighbor's kids 6 times, earning $10 each time she babysits them. Her parents pay her $8 each time she mows the lawn. If Sara already had $20 saved before she started babysitting, how many times must she mow the lawn before she can afford the jacket and shoes? She plans to keep any extra money in a special savings jar.",
    "gold_num": "15"
  },
  {
    "question": "Sloane volunteered at her community center and tracked daily foot traffic as part of her training. She noticed interesting patterns over the week. While at the dollar store, Sloane counts 120 customers entering the store. The next day, she counts 80 more customers than the first day. If the total number of customers by the third day was 700, how many customers did she count on the third day? She then shared these findings with the store manager to improve staffing schedules.",
    "gold_num": "380"
  },
  {
    "question": "Lori saved up from her weekend shifts so she could reward herself with new accessories. She calculated exactly how many hours she needed to work. Lori wants to buy a $500.00 pair of shoes and a matching belt that is $50.00. Her part-time job pays her $10.00 an hour. How many hours will she have to work before she can make her purchase? With that information, she schedules extra hours at the café.",
    "gold_num": "55"
  },
  {
    "question": "During a relaxing weekend at home, Carmen challenged herself with brain-teasing puzzles to unwind. She timed each session precisely to track her progress. It takes Carmen 12 minutes to finish a crossword puzzle and 7 minutes to finish a sudoku puzzle. Over the weekend she solved 5 crossword puzzles and 10 sudoku puzzles. How much time did she spend playing these games? Afterwards, she rewarded herself with a treat for completing so many puzzles.",
    "gold_num": "130"
  },
  {
    "question": "Andy spent a sunny afternoon working in his garden and decided to plant an even larger variety of flowers this season. He always enjoyed experimenting with different bloom combinations. Andy plants 120 geraniums and 50 fewer petunias than geraniums. How many flowers does he plant total? He then arranged them in colorful patterns across his lawn.",
    "gold_num": "190"
  },
  {
    "question": "Carlos and Benji planned a day at the seaside and wanted to make the most of their water activities. They compared rental options to stay within budget. Carlos and Benji are at the beach. Carlos rents a canoe for $40 an hour and Benji rents a banana boat raft for $25 an hour. If Carlos uses the boat for 4 hours and Benji uses the raft for 6 hours, how much will they pay for their rentals, altogether? Afterwards, they relaxed under a shaded umbrella.",
    "gold_num": "310"
  },
  {
    "question": "On a large watermelon farm, the harvest season was in full swing. The farm produced 300 baby watermelons this year. Ashlyn visited the farm after two months and discovered that 40% of the watermelons were ready for harvest, so she took them home. When she returned two weeks later, 4/5 of the remaining melons were ready, so she harvested those as well. How many melons were not ready to be harvested after the two weeks? It's amazing how quickly the fruit ripens in the summer sun.",
    "gold_num": "36"
  },
  {
    "question": "Dax enjoyed exploring their family's orchard, which was teeming with life. This time, Dax found half as many bugs as ants in the garden. If there were 120 ants, calculate the total number of insects in the garden. The garden always surprises Dax with its little inhabitants.",
    "gold_num": "180"
  },
  {
    "question": "Johnny decided to save up for something special. He took his allowance of $50 and added an extra $40 to it. He then invested this sum of money, which quadrupled in a year. How much money did he have after a year? Johnny was thrilled to see his savings grow so fast.",
    "gold_num": "360"
  },
  {
    "question": "Mary is three years younger than Joan, who is eight years older than Jessa. If Jessa is 35 years old, what is the sum of the ages of the three girls? Their family loves celebrating birthdays together every year.",
    "gold_num": "113"
  },
  {
    "question": "Dolly has five books. Pandora has three. If both Dolly and Pandora read each others' books as well as their own, how many books will they collectively read by the end? It's great to share stories with friends.",
    "gold_num": "16"
  },
  {
    "question": "Isabelle bought party supplies for her little sister’s birthday party. She spent $30 on ingredients for the cake, $85 on birthday presents, $40 on decorations, $10 on invitations, and $60 on goodie bags for the party guests. She split the cost evenly four ways with her three parents. How many dollars did each person pay? Planning a party can be expensive, but sharing the cost makes it easier.",
    "gold_num": "56.25"
  },
  {
    "question": "A chef bought 8 bags of onions. Each bag weighs 75 pounds. A pound of onions cost $2. How much did the chef spend? The chef was preparing for a big festival feast.",
    "gold_num": "1200"
  },
  {
    "question": "Maddison has 12 boxes with 80 marbles in each box. Then she gets 50 marbles from her friend. How many marbles does she have now? Maddison loves collecting and trading marbles with her friends.",
    "gold_num": "1010"
  },
  {
    "question": "There are 18 trees in Chris's yard. Ferdinand has half the number of trees that Chris has. Harry has 7 more than twice the number of trees that Ferdinand has. How many more trees are in Harry's yard than Ferdinand's yard? The friends often compare their yards to see who has the most trees.",
    "gold_num": "16"
  },
  {
    "question": "A juggler can juggle 32 balls. Half of the balls are golf balls, and half of the golf balls are blue. How many blue golf balls are there? The audience is always amazed by the juggler's colorful performance.",
    "gold_num": "8"
  },
  {
    "question": "Matthew is preparing to landscape his backyard garden this summer. He plans every task meticulously to optimize his workflow. It takes Matthew 4 minutes to dig a small hole for shrubs and 12 minutes to dig a large hole for trees. How many hours will it take him to dig 36 small holes and 18 large holes? Once all the holes are ready, he will line them with nutrient-rich compost before planting.",
    "gold_num": "6"
  },
  {
    "question": "In a small village, siblings Ruby and Sam enjoy math puzzles together. They often compare their ages to see how they grow. Ruby is 8 times older than Sam. In 12 years, Ruby will be 4 times as old as Sam. How old is Sam now? They plan to celebrate their birthdays with a themed cake based on these numbers.",
    "gold_num": "9"
  },
  {
    "question": "On a sunny afternoon, Peter stops by a local shop to cool off with frozen treats. He carefully calculates his budget before making a choice. Peter purchased 40 popsicles at $0.50 each. He also purchased 8 ice cream bars at $0.75 each. How much did he pay in total in dollars? After enjoying the treats, he donated the remaining ice creams to his neighbors.",
    "gold_num": "26"
  },
  {
    "question": "Ann and her brother share a close bond and love solving age riddles. Each year, they test how well they can predict their future ages. If Ann is 12 years old and her brother is three times her age, how old will her brother be in 5 years? They will use this puzzle as part of their birthday party invitations.",
    "gold_num": "41"
  },
  {
    "question": "In a busy household, rice consumption needs careful planning to avoid shortages. The family usually tracks how long each bag lasts. Each person in a certain household consumes 0.25 kg of rice every meal. Supposing 6 members of the household eat rice every lunch and dinner, how many weeks will an 84 kg bag of rice last? Once it runs out, they plan to switch to quinoa for a change.",
    "gold_num": "4"
  },
  {
    "question": "Annika arrives at the town fair excited to try all the attractions. She counts her money to ensure she won't overspend. Annika brought $100 to the town fair. She spent half of it on food and snacks, and an additional $25 for rides. How much, in dollars, is left? She plans to save the remainder for souvenirs.",
    "gold_num": "25"
  },
  {
    "question": "John challenges every newcomer to an arm wrestling match at the fair. He keeps track of his wins and losses to boast on social media. John arm wrestles 30 people. He beats 90%. How many people did he lose to? After tallying the results, he posts a summary of his strength gains online.",
    "gold_num": "3"
  },
  {
    "question": "A lively party begins with friends greeting each other at the door. The host notices how many people stay and leave during the evening. At the beginning of the party, there were 36 men and 24 women. After an hour, 1/4 of the total number of people left. How many women are left if 33 men stayed at the party? The remaining guests continue dancing to their favorite songs.",
    "gold_num": "12"
  },
  {
    "question": "Scotland's historical sites attract tourists from around the world. Among these are ancient castles with fascinating backstories. There are 300 castles in Scotland. 50 percent of them are ruins, and 60 percent of the ruined castles are unmanned. How many unmanned ruined castles are there in Scotland? Travelers plan their next itinerary to visit each site.",
    "gold_num": "90"
  },
  {
    "question": "Laurel's preparations for her baby shower include organizing gifts and counting items. She wants to know exactly how many outfits she'll have when her baby arrives. Laurel's friend gave her 30 baby outfits that her child no longer needed. At her baby shower, Laurel received three times that amount of new baby outfits. Then, Laurel's mom gifted her with another 20 baby outfits. How many outfits does she have for her baby? She plans to display them in a color-coded wardrobe chart.",
    "gold_num": "140"
  },
  {
    "question": "When visiting a new restaurant in town, you notice they offer a variety of juice boxes at different prices. Juice Box A is 14 dollars. Juice Box B is 9 dollars more than Juice Box A. Juice Box C is 13 dollars more than Juice Box A. How much more is Juice Box C than Juice Box B? The menu has so many options, it can be tricky to compare prices at a glance.",
    "gold_num": "4"
  },
  {
    "question": "A large banquet hall is being set up for a wedding. The organizers have 80 tables with 6 legs each and 90 tables with 5 legs each. Calculate the total number of legs the hall's tables have. This will help the team ensure all tables are stable for the big event.",
    "gold_num": "930"
  },
  {
    "question": "During a shopping spree, Davos bought 4 shirts from the mall that cost $60 each. If he bought them with a 50% discount, how much did Davos pay for the 4 shirts? Shopping during sales can really help you save a lot of money.",
    "gold_num": "120"
  },
  {
    "question": "April is helping a local school expand their garden. They ask for 60 plant pots for the daisies, and three times as many for the roses. April had already bought 400 plant pots from the garden center before she knew how many she needed. How many plant pots does April have left over? It's always good to have some extras just in case.",
    "gold_num": "160"
  },
  {
    "question": "There are three trees in Eddy's backyard, and they are all growing quickly. The shortest tree has a height of 16 feet, and the second tree has a height of 11 feet more than the shortest tree. The height of the tallest tree is twice the height of the two trees combined. How tall is the tallest tree? Eddy is amazed at how fast his trees are growing.",
    "gold_num": "86"
  },
  {
    "question": "There are 16 girls in the park, all playing together. If there are three times the number of boys in the park, how many kids are in the park? It's a busy and lively day at the park with so many children around.",
    "gold_num": "64"
  },
  {
    "question": "Mary has 60 sheep on her farm. She gets 3 kg of milk from half of them and 4 kg of milk from the other half every day. How much milk does she collect every day? Mary's farm is known for its high-quality milk.",
    "gold_num": "210"
  },
  {
    "question": "Mrs. Sherman baked two dozen bread rolls for breakfast. After feeding her 10 children with one each, she broke each of the remaining rolls into 10 pieces and fed them to the chickens. How many pieces of rolls did she feed to the chickens? The chickens always look forward to breakfast time.",
    "gold_num": "140"
  },
  {
    "question": "Lindsay is doing the laundry for her big family, and she suspects some socks are missing. There are 100 socks that need washing. If she washes 20 pairs of socks and 25 loose socks, how many socks has Lindsay missed? Laundry day can be quite the puzzle sometimes.",
    "gold_num": "35"
  },
  {
    "question": "Cho decided to go on a challenging hike, covering 18 kilometers per hour for 12 hours. Chloe hiked 13 kilometers per hour and stopped after 8 hours. How many kilometers farther did Cho hike? Both friends enjoyed their adventure in the great outdoors.",
    "gold_num": "112"
  },
  {
    "question": "Begin by reflecting on how individual amounts combine to form a shared total in a collaborative setting.\n\nAxel has 150 silver pesos and 200 gold pesos. He visits her friend Anna who has twice as many silver pesos as he has and 80 more gold pesos. What's the total number of pesos they have together?\n\nMake sure to calculate each person's holdings separately before summing for the final answer.",
    "gold_num": "930"
  },
  {
    "question": "This exercise demonstrates applying unit costs to multiple items to find an overall expense.\n\nAn eraser costs $5 and a pencil costs $7. How much do 12 erasers and 15 pencils cost?\n\nRemember to multiply each quantity by its unit price and then add the subtotals together.",
    "gold_num": "165"
  },
  {
    "question": "Practice proportional reasoning by comparing message delivery volumes across two recipients.\n\nJames is in charge of running messages from the office to each teacher's classroom. If he delivers 150 messages to Ms. Thompson and 1/3 as many messages to Mr. Yu, how many messages does he deliver total?\n\nThink about how the fractional relationship affects the second count before adding both amounts.",
    "gold_num": "200"
  },
  {
    "question": "Allocating resources evenly often involves dividing a total across multiple parts.\n\nMonica is wrapping Christmas gifts. She has 10 gifts to wrap for her family, 8 gifts to wrap for her friends and 5 gifts to wrap for her teachers. She has 230 inches of ribbon and wants to make a bow for each gift with it. How many inches of ribbon can she use for each gift bow?\n\nDivide the total ribbon equally to find the per–gift allocation.",
    "gold_num": "10"
  },
  {
    "question": "Age differences can be unpacked through sequential comparisons using addition and subtraction.\n\nAlice is 10 years older than Beth, who is 8 years older than Erica. What is the difference between the ages of Alice and Erica, if Erica is 40 years old?\n\nTrace the age gaps step by step to determine the final difference.",
    "gold_num": "18"
  },
  {
    "question": "Nutritional calculations require multiplying volume, frequency, and unit values accurately.\n\nA glass of milk is 12 ounces of milk. John drinks 3 glasses of milk. If milk has 4 calories per ounce how many calories did he consume?\n\nMultiply each dimension carefully to arrive at the total caloric intake.",
    "gold_num": "144"
  },
  {
    "question": "Scaling recipes and adjusting for packaging sizes involves both multiplication and division.\n\nMark is making a quadruple batch of brownies. The normal recipe calls for 9 cups of flour and 4 cups milk. If flour is sold in 3-cup bags and milk is sold in 4-cup bottles, how many more bags of flour than bottles of milk does Mark have to buy?\n\nCalculate the total ingredient needs first, then determine packaging counts to compare them.",
    "gold_num": "8"
  },
  {
    "question": "Batch planning ensures enough quantities to last a given period by converting daily use into total supply.\n\nShannon makes her own madeleine cookies and eats 4 a night as a treat. She wants to make enough cookies to last her for 36 days by storing them in the freezer. Her recipe makes 2 dozen madeleine cookies. How many dozens of cookies will she need to make so she has enough for 36 days?\n\nConvert days and nightly consumption into total cookies and then into the number of dozens needed.",
    "gold_num": "12"
  },
  {
    "question": "Discount calculations on multiple items test your ability to apply percentages to unit prices and multiply across quantities.\n\nMisha picks out 6 blouses from the 40% off rack. The regular price for each blouse is $25. How much is the total cost of the discounted blouses?\n\nDetermine the sale price per blouse and then scale by the number of items for the final cost.",
    "gold_num": "90"
  },
  {
    "question": "This scenario models sequential subtractions from an initial group followed by a fractional departure.\n\nThere were 100 cats on a rock. Six boats came and carried away 10 cats each, and later, 3/5 of the remaining cats ran after a mouse they'd seen. How many cats were left on the rock?\n\nRemove the boats' cats first, then calculate the fraction that ran away to find the number still on the rock.",
    "gold_num": "16"
  },
  {
    "question": "The employees of a large tech company planned an exciting outing to celebrate their recent achievements. To accommodate everyone, 7 buses were rented, each with the capacity to hold 85 employees. Additionally, 9 minibuses that can each hold 45 employees, and 15 minivans that can each hold 22 employees were arranged for the trip. How many employees can join the day trip? This event promises to be a memorable experience for all participants.",
    "gold_num": "1330"
  },
  {
    "question": "Indras has 12 letters in her name, making it quite unique. Her sister's name has 6 more letters than half of the letters in Indras' name. How many letters are in Indras and her sister's names combined? Their parents always enjoyed coming up with creative names.",
    "gold_num": "24"
  },
  {
    "question": "30 gallons of gas were equally divided into 8 different containers for a community gardening project. Josey needed 1/3 of a container to run her lawnmower for the day. How many pints of gasoline did Josey need? She carefully measured the fuel to avoid any waste.",
    "gold_num": "10"
  },
  {
    "question": "Ray had 48 lollipops after visiting the candy store. He kept 8 lollipops for himself and shared the remaining equally with his eight friends. How many lollipops did each of his friends receive? Ray enjoyed seeing the smiles on his friends' faces as they received their treats.",
    "gold_num": "5"
  },
  {
    "question": "Antoine is refining his catering budget with precise cost calculations. Consider how bulk purchase savings affect per-portion pricing.\n\nThe French onion soup recipe calls for 5 pounds of onions. He likes to double that amount. His soup serves 8 people. The onions are currently on sale for $3.00 a pound. He also needs 4 boxes of beef stock, that are also on sale for $3.00 a box. What is the cost per serving? (Round to the nearest integer.)\n\nReflect on how each ingredient’s cost contributes to the final per-portion price.",
    "gold_num": "5"
  },
  {
    "question": "Bead purchases can illustrate comparative totals and multiplication in everyday contexts. Pay attention to how unit sizes and pack counts scale overall quantities.\n\nTwo sisters, Elizabeth and Margareth, bought beads. Elizabeth bought 2 packs of red and 4 packs of clear beads, while Margareth bought 5 packs of blue and 6 packs of red beads. If each pack of beads contains 25 pieces of beads, how many more beads does one sister have than the other?\n\nUse this scenario to practice subtraction after scaling by pack size.",
    "gold_num": "125"
  },
  {
    "question": "Holiday recipes often require careful portion planning, especially with limited resources. Work through how total ingredient counts translate into serving equipment.\n\nRozanne is making eggnog for her family. She uses 7 dozen eggs that were in cases and another 5 eggs that were loose in the cupboard. She puts out trays that each hold 4 glasses of eggnog. If each glass needs 5 eggs, how many trays can Rozanne put out?\n\nConsider how to convert dozens to individual units and allocate them across containers.",
    "gold_num": "4"
  },
  {
    "question": "Art supply counts highlight the importance of multiplication and addition in inventory tasks. Observe how packet sizes change overall totals.\n\nBeatrice bought 14 packets of crayons for her Art class. Eight of the packets had 12 pieces each, and the other six packets had 18 pieces each. How many colors of crayons did Beatrice buy in all?\n\nBreak down the quantities by packet type and then combine them for the final total.",
    "gold_num": "204"
  },
  {
    "question": "Grayson is passionate about the environment and makes it a habit to recycle cans and bottles for extra money every week. An aluminum can is now worth four cents and a plastic bottle is worth seven cents. She drinks six aluminum cans of soda and nine plastic bottles of water each week. How many cents does Grayson earn from recycling in a six-week period? Recycling is not only good for the planet, but it also helps Grayson save up for things she enjoys.",
    "gold_num": "486"
  },
  {
    "question": "Ali started the week with $43. Leila, feeling generous, decided to give him half of her $220. How much does Ali have now? With this extra money, Ali plans to buy a new gadget he has been eyeing for months.",
    "gold_num": "153"
  },
  {
    "question": "Ashley loves pizza nights and recently ordered a large meal for her friends, costing $27. What is the total amount that Ashley should give the delivery person if she wants to leave a tip that is equal to 1/5 of the amount she ordered? It's always nice to reward good service with a fair tip.",
    "gold_num": "32.4"
  },
  {
    "question": "Mary has been stocking up on baking supplies and now has 13 jars of sprinkles in her pantry. Each jar of sprinkles can decorate 11 cupcakes. Mary wants to bake enough cupcakes to use up all of her sprinkles. If each pan holds 15 cupcakes, how many pans worth of cupcakes should she bake? Baking is Mary's favorite way to relax on the weekends.",
    "gold_num": "10"
  },
  {
    "question": "Marissa is curious about how school supplies diminish over time. Consider the scenario below to practice fractional reasoning.\n\nThere are 60 students in Marissa’s class. Each student started the year with 15 pencils. After two months, 1/5 of the total pencils in class were used. At the end of the year, only 1/3 of the remaining pencils were left. How many pencils were left?\n\nReflect on the steps needed to arrive at the final count.",
    "gold_num": "240"
  },
  {
    "question": "Preparing for an athletic goal requires careful planning of your time. The following problem will test your ability to divide total requirements across a schedule.\n\nIt takes 480 minutes of walking to break in a new pair of shoes. Jason wants to try out for the track team in four weeks. If he can walk 5 days a week to break in the new shoes, how long does he have to spend walking each day?\n\nUse this scenario to calculate Jason’s daily walking time.",
    "gold_num": "24"
  },
  {
    "question": "In an art class, sharing supplies highlights proportional reasoning. The example below shows how quantities relate through multiplication and ratios.\n\nBen has 10 tubes of blue paint and 12 tubes of yellow paint. Jasper has half as many tubes of blue paint as Ben, and three times as many tubes of yellow paint as Ben. How many tubes of paint does Jasper have?\n\nThink about how to compute Jasper’s total using those ratios.",
    "gold_num": "41"
  },
  {
    "question": "Coin weights can vary over the years, demonstrating proportional relationships. The problem below applies fractional comparison to a real-world object.\n\nBelen has two kinds of pennies, a 2020 penny and a 1950 penny. The 2020 penny is four-fifths the weight of the 1950 penny. If the 1950 penny weighs 60 grains, what is the combined weight of the two pennies?\n\nAnalyze the weights by applying the given fraction.",
    "gold_num": "108"
  },
  {
    "question": "Let's dive into a fun math scenario involving Stetson and Alec. Stetson made a bet with Alec that he would give up $25 for each orange he eats. While at the farm, Stetson ate 3/5 of the oranges they picked. If they picked 120 oranges, calculate the total amount of money Stetson gave up? Think carefully about the proportions and the new values before answering.",
    "gold_num": "1800"
  },
  {
    "question": "Imagine Uncle Ben is preparing for a busy week at the ranch. Uncle Ben has eight horses. Each horse can consume ten pounds of oats per meal. He feeds his horses twice a day. If one bag contains 100 pounds of oats, how many bags of oats does he need to feed his horses for ten days? Make sure to consider all the details in your calculation.",
    "gold_num": "16"
  },
  {
    "question": "Picture an eager 10-year-old who dreams of buying a new toy car that costs $24. He already has $8 in savings. How many days will it take him to save the remaining amount of money if he promises to save $4 daily from his allowance? Take your time to work through the updated numbers.",
    "gold_num": "4"
  },
  {
    "question": "Sally is throwing a pizza party and wants to make sure she has enough for everyone. Sally buys one small pizza at $16 and one family-size pizza that costs 4 times as much as the small pizza. How much does she spend in all? Double-check your calculations with the new prices.",
    "gold_num": "80"
  },
  {
    "question": "Planning large‐scale baking projects requires careful ingredient tracking. Brianne and Ashley make greek orange pie. Ashley brought 10 boxes with 20 oranges in each box, while Brianne brought 50 more oranges than Ashley. If one greek orange pie needs 5 oranges, how many greek orange pies can they make? After computing your answer, reflect on how using different numbers of oranges per pie would change the total number of pies they could prepare.",
    "gold_num": "90"
  },
  {
    "question": "Developing a personal budget helps illustrate savings potential over time. Gerald works at a daycare that pays him $50 every day. He worked for an entire week and spent a total of $200. How much does he have left? Consider how unplanned expenses or extra workdays would alter his final savings.",
    "gold_num": "150"
  },
  {
    "question": "Understanding percentage‐based spending is a key financial skill. Julie had $1500. She spent 20% of it on clothes and then 30% of the remaining money on CDs. How much money did Julie have left? After solving, think about how different spending percentages impact the final balance.",
    "gold_num": "840"
  },
  {
    "question": "Bake-off competitions often hinge on production efficiency. The eighth-grade class held a bake-off. Kelsie made two times more cookies than Josh. Josh made one-fourth the number of cookies that Suzanne made. If Suzanne made 100 cookies, how many did Kelsie make? Once you’ve answered, consider how different interpretations of “two times more” might affect the count.",
    "gold_num": "50"
  },
  {
    "question": "In many baking scenarios, ensuring fair allocation of ingredients can simplify planning. Heather bought a jumbo bag of raisins with 45 cups of raisins in it. She wants to make oatmeal cookies, granola, and snack mix with the raisins. A batch of oatmeal cookies takes 3/4 of a cup of raisins. How many batches of oatmeal cookies can Heather make if she divides the bag of raisins equally among the cookies, granola, and snack mix? After solving, think about how changing the fraction of ingredients used per batch would impact the total number of batches.",
    "gold_num": "20"
  },
  {
    "question": "Everyday math often involves relationships and simple transactions. Nick had twice as many candies as George. Then George ate 8 candies. Now George has 12 candies left. How many candies does Nick have? Once you get the answer, consider how increasing the number of eaten candies shifts Nick’s total.",
    "gold_num": "40"
  },
  {
    "question": "Age differences provide straightforward applications of subtraction and addition. Chenny is 15 years old. Alyana is 5 years younger than Chenny. How old is Anne if she is 3 years older than Alyana? After calculating, reflect on how adjusting these age gaps changes the final age.",
    "gold_num": "13"
  },
  {
    "question": "Organizing books by thickness can be seen as a practical exercise in addition and multiplication. Four books are arranged on a shelf. The first book is 60 mm thick while the second book is 100 mm thick. The third book is 30 mm less thick than the second book, and the fourth book is twice as thick as the first book. What is the total thickness of the four books? Once you have the total, think about how different thickness relationships affect the combined measurement.",
    "gold_num": "350"
  },

  {
    "question": "Consider the following scenario carefully. Emma can make and upload 144 vlogs per month. But she was only able to make 36 vlogs for the first week, 42 vlogs for the second week, and 30 vlogs for the third week. How many vlogs should she do to complete the 144 vlogs per month? Please provide the detailed answer based on the given data.",
    "gold_num": "36"
  },
  {
    "question": "Consider the following scenario carefully. For each small task accomplished, Jairus gets $1.6 while Jenny gets $1. If each of them finished 40 tasks, how much more will Jairus get than Jenny? Please provide the detailed answer based on the given data.",
    "gold_num": "24"
  },
  {
    "question": "Consider the following scenario carefully. Jeff’s work is 6 miles away.  He walks there and back each day he works.  How many miles does he walk if he has to work 10 times a week? Please provide the detailed answer based on the given data.",
    "gold_num": "120"
  },
  {
    "question": "Consider the following scenario carefully. John plans to save money from working.  He gets paid $8 per hour and works 10 hours a day for 4 days a week.  If he wants to save $160 how many weeks will it take him? Please provide the detailed answer based on the given data.",
    "gold_num": "1"
  },
  {
    "question": "Consider the following scenario carefully. How much does it cost you for lunch today at Subway if you pay $80 for a foot-long fish sub and thrice as much for a six-inch cold-cut combo sub? Please provide the detailed answer based on the given data.",
    "gold_num": "320"
  },
  {
    "question": "Consider the following scenario carefully. Timothy's locker is 48 cubic inches. Zack's locker is half as big as Timothy's locker. Peter's locker is 1/4 as big as Zack's locker. How big is Peter's locker in cubic inches? Please provide the detailed answer based on the given data.",
    "gold_num": "6"
  },
  {
    "question": "Consider the following scenario carefully. A stickler for health, Octavia drinks half the daily recommended cups of coffee. By contract, Octavia’s husband Juan drinks 20 times the amount of coffee she drinks. Juan’s doctor has asked him to reduce his coffee intake to the daily recommendation of 8 cups. By how many cups must Juan reduce his daily coffee intake? Please provide the detailed answer based on the given data.",
    "gold_num": "32"
  },
  {
    "question": "Consider the following scenario carefully. Cody and Trevor had 24 sandwiches. Cody ate a third of the sandwiches, and Trevor ate a quarter of the sandwiches. How many sandwiches are left? Please provide the detailed answer based on the given data.",
    "gold_num": "10"
  },
  {
    "question": "In many conservation efforts, tracking wildlife activity with averages can reveal important trends. Mack wants to count things and decided to count how many birds there are in the sky over the next week. On days one and two, Mack saw a total of 80 birds. On day three he saw 10 birds. On days four and five, he saw 200 birds. On day six he saw 50 and on day seven he saw 150. On average, how many birds did Mack see in a day? After solving, consider how an unusually high or low day can skew the average.",
    "gold_num": "70"
  },
  {
    "question": "Understanding simple arithmetic relationships can help solve everyday problems. A boy has 20 cards. His brother has 6 fewer cards than he has. How many cards do they have together? Once you've calculated the total, reflect on how changing the difference between card counts affects the sum.",
    "gold_num": "34"
  },
  {
    "question": "To plan for a long-term vision care regimen, Pete needs to estimate per-pair costs accurately. 120 single-use contacts come in 1 box and will last Pete 60 days. Each box is $300.00 and currently 20% off. If he buys 3 boxes of contacts, how much will each pair of contacts cost? Consider how varying the discount rate or number of boxes affects the per-pair price.",
    "gold_num": "4"
  },
  {
    "question": "To study the impact of different breakfast choices, it’s useful to compare cumulative weight changes over time. If Martin eats Cheerios every day for breakfast, he'll lose 2 pounds/week. If he eats donuts every day for breakfast, he'll gain 4 pounds/week. What will be the difference in his weight at the end of 8 weeks between the two breakfast options? After finding the answer, think about how extending the number of weeks would change the overall weight difference.",
    "gold_num": "48"
  },
  {
    "question": "Consider the following scenario carefully. A cup of mushrooms weighs 200 grams and has 6 grams of protein. If John eats 400 grams of mushrooms every day how many grams of protein does he get per week? Please provide the detailed answer based on the given data.",
    "gold_num": "84"
  },
  {
    "question": "Consider the following scenario carefully. A plane travels 2400 miles in 6 hours. At the same rate, how many additional hours would it take to travel an additional 4000 miles? Please provide the detailed answer based on the given data.",
    "gold_num": "10"
  },
  {
    "question": "Consider the following scenario carefully. John decides to build a program capable of identifying cancer cells. He gets initial funding of $200,000 for the first 10 months of research. His research ends up taking 20 times that long and every month after those first 10 took 50% more funding per month. How much did his research cost? Please provide the detailed answer based on the given data.",
    "gold_num": "5900000"
  },
  {
    "question": "Consider the following scenario carefully. A Reddit group has 2000 members. If each member posts an average of 6 posts per day, what's the total number of posts that the group will have in March? Please provide the detailed answer based on the given data.",
    "gold_num": "372000"
  },
  {
    "question": "In many real-world scenarios, comparing expenditures helps us understand budget priorities and cost management. Two sports coaches went shopping together. The baseball coach bought 12 new baseballs for $5 each. The basketball coach bought 10 new basketballs for $20 each. How much more did the basketball coach spend than the baseball coach? After solving, think about how changing either the price per ball or the quantity purchased would affect the spending difference.",
    "gold_num": "140"
  },
  {
    "question": "To plan for a thriving garden, it’s useful to calculate totals before and after blooming. Arianna plants a garden that has 12 rows of flowers with 30 flowers in each row. Currently, only 4/5 of the planted flowers have bloomed. How many flowers in Arianna's garden have bloomed? Once you’ve found the answer, consider how altering the number of rows or the bloom fraction would impact the total.",
    "gold_num": "288"
  },
  {
    "question": "Understanding relative quantities can clarify how one value depends on another. Tommy caught 5 more fish than Darren and Darren caught 8 less than Naomi. If Naomi caught 25 fish, how many fish did Tommy catch? When you’re done, reflect on how different offsets would change Tommy’s total catch.",
    "gold_num": "22"
  },
  {
    "question": "Analyzing publication rates over time is essential for media planning and analytics. A news website publishes an average of 25 political and weather news articles every day. Its sister company publishes an average of 15 business news articles daily. Calculate the total number of articles the two websites published together in February if there are 29 days in the month. Afterward, think about how a longer month or different daily averages would alter the combined total.",
    "gold_num": "1160"
  },
  {
    "question": "In preparation for a large community baking event, precise measurements are crucial. A bag of flour is divided into 10 portions of 3 kilograms each. How much flour (in kilograms) was in six bags in total, before it was divided into portions? After solving, consider how increasing the number of bags or portions would scale the total quantity needed.",
    "gold_num": "180"
  },
  {
    "question": "To plan a multi-day cycling tour, it helps to break down each rider’s distance. Alisa biked 15 miles per hour for 6 hours. Stanley biked at 12 miles per hour for 4 hours. How many miles did Alisa and Stanley bike in total? Once you’ve calculated the sum, reflect on how altering speed or duration affects the overall journey length.",
    "gold_num": "138"
  },
  {
    "question": "When organizing a large brunch gathering, it’s important to know how many ingredients to buy. Lori needed 1 whole egg to make 2 deviled egg halves. She anticipates that each of her 24 guests will eat 4 deviled egg halves. If she is inviting 24 guests to her party, how many dozens of eggs will she need? Think about how changing the number of halves per guest influences the total eggs required.",
    "gold_num": "4"
  },
  {
    "question": "During a morning assembly, faculty members gathered on the court to discuss the day’s events. The following problem will test your understanding of percentages and basic multiplication. Out of the 200 teachers on the school basketball court, 65% are history teachers. If the rest of the teachers on the court are math teachers, and each teacher sleeps for 7 hours a day, calculate the total time the math teachers collectively spend sleeping in one day. Reflect on how changing one of the variables would impact your final result and be sure to double-check your work afterward.",
    "gold_num": "490"
  },
  {
    "question": "On his way home, Adam stopped by a neighborhood confectionery known for its colorful sweets. Consider this scenario as a real-world budgeting exercise. Adam went to a store to buy some sweets. He bought 12 candies of type A and 15 candies of type B. One candy of type A costs $0.75, and one candy of type B costs $1.00. How much change did Adam get, if he paid the cashier $40? After solving, think about how such simple calculations can help manage your own spending and verify each arithmetic step carefully.",
    "gold_num": "16"
  },
  {
    "question": "Janey is organizing her bookshelf and realizes she has 5 more than three times the number of books that Sally owns. If Janey has 32 books, how many does Sally have?",
    "gold_num": "9"
  },
  {
    "question": "John and Jack are hurrying to school and have 45 minutes to get there before the bell rings. It takes them 10 minutes to reach the corner where the library is. Then, it takes another 18 minutes to reach the fire station. How much longer do they have to reach school without being late?",
    "gold_num": "17"
  },
  {
    "question": "Catherine goes to the grocery store to stock up on fruit. She buys 2 kilos of apples for $5 per kilo, 3 kilos of bananas for $3 per kilo, and 4 kilos of oranges for $4 per kilo. How many dollars does she pay in total?",
    "gold_num": "31"
  },
  {
    "question": "Greta and Celinda are preparing for a bake sale. Greta bakes 40 cookies and Celinda bakes three times as many. If they eat 20 of the cookies while they are cooling and put the rest in a box, how many cookies are there in the box?",
    "gold_num": "140"
  },
  {
    "question": "There is space for 36 pencils in the box. If there are 8 pencils missing from the box, how many pairs of pencils are in the box?",
    "gold_num": "14"
  },
  {
    "question": "Given a 10-day tutoring package, how much does Alex charge for 3 weeks of tutoring if she charges $15 per day?",
    "gold_num": "315"
  },
  {
    "question": "A pencil costs $1, and an eraser costs $0.50. If you bought 10 pencils and 12 erasers and paid $20, how much change would you get?",
    "gold_num": "3"
  },
  {
    "question": "Castle bought 6 boxes of Coco Crunch and 8 boxes of Fruit Loops this week. Last week she bought 5 boxes of cereal. How many more boxes of cereal did she buy this week than last week?",
    "gold_num": "9"
  },
  {
    "question": "At 8:00, 9000 people lined up at a polling station to cast their vote on election day. By midday, 3/7 of the people had voted and by 16:00, 3/4 of the remaining people had voted. What's the number of those who had not voted by 16:00?",
    "gold_num": "750"
  },
  {
    "question": "Parker has developed a habit of chewing gum throughout the day to keep himself focused. Every day, he chews 7 pieces of gum. If each pack of gum contains 20 pieces, and Parker wants to make sure he has enough gum to last him 40 days, how many packs of gum will he need to buy to last the entire period? Make sure to consider that he cannot buy a fraction of a pack.",
    "gold_num": "14"
  },
  {
    "question": "Peter is experimenting with making ice cubes of various sizes for a party. He starts with 48 ounces of water. He decides to make 5 giant cubes (using 5 ounces each), 10 medium cubes (using 3 ounces each), and 12 small cubes (using 1 ounce each). After making all these cubes, how many ounces of water does he have remaining?",
    "gold_num": "1"
  },
  {
    "question": "Jeremy was enjoying a sunny afternoon in his backyard when he noticed 18 birds perched on the fence. He accidentally startled them, causing 1/3 of the birds to fly away. Shortly after, 30 more birds joined the ones that stayed. How many birds are now in the backyard?",
    "gold_num": "42"
  },
  {
    "question": "At a certain school, there are two large classes with a combined total of 120 students. Each class has the same number of students, and in each class, 40% are girls. Can you figure out how many boys are in each class?",
    "gold_num": "36"
  },
  {
    "question": "Mara was preparing for a party and started by adding 6 slices of cake to a plate that already had 4 slices. She realized she needed more, so she quadrupled the number of slices she had at that moment. After eating 3 slices herself, her friend sneaked in and took 7 slices from the plate. How many slices of cake were left on the plate?",
    "gold_num": "24"
  },
  {
    "question": "A tomato vendor is looking to cut costs. He sells 700 tomatoes each day. Previously, he bought them at $0.6 each, but he found a new supplier who offers them at $0.45 each. Over the course of a week, how much money does the vendor save by switching suppliers?",
    "gold_num": "735"
  },
  {
    "question": "Gunther the gorilla had a secret stash of 72 bananas hidden under a fern. While Gunther was away, Arnold the chimpanzee managed to steal half of the bananas. The next day, Gunther found out and added 35 more bananas to his pile, but Arnold returned that evening and took another 18 bananas. On the third day, Gunther added 10 more bananas and finally counted his stash. How many bananas did Gunther find he had left?",
    "gold_num": "53"
  },
  {
    "question": "A stylish handbag is on sale with a 10% discount. If the original price is $180, how much will you pay after the discount is applied?",
    "gold_num": "162"
  },
  {
    "question": "George loves collecting fruit and now has 65% more pears than bananas. If he currently has 320 bananas, how many pieces of fruit does George have in total?",
    "gold_num": "528"
  },

  {
    "question": "Market analysts have been tracking daily fragrance sales to spot emerging trends. A perfume company is trying to create new scents. They already have 6 vanilla scents and 12 fruity scents available and they need to decide which kind of scent to focus on. They decide to focus on whichever scent sells the most and monitor their number of sales as part of their research. By the end of the day, they sell 10 of each of the vanilla scents and 4 of each of the fruity scents available. How many more vanilla scents sold compared with the fruity scents? This outcome will guide the company’s production planning.",
    "gold_num": "12"
  },
  {
    "question": "A dedicated agricultural consultant prepared detailed revenue estimates each week. Bennet is a farmer. He sells 24 of his eggplants for $5 each. He has 30 ears of corn that he can sell as well. If Bennet wants to make a total of $300, how much should he sell each ear of corn for? After performing this computation, he will finalize his pricing strategy for the farm stand.",
    "gold_num": "6"
  },
  {
    "question": "During the holiday promotion, buyers tracked their potential savings carefully. The price of a laptop is $1500. If you get a 25% discount, how much do you have to pay? This result will be used to update the retailer’s sales forecast.",
    "gold_num": "1125"
  },
  {
    "question": "As part of inventory planning, the manager reviewed weekly TV sales distributions. Samwell owns an appliances store. For this week, one-fourth of their sales are smart TVs, one-eighth are analog TVs, and the rest are OLED TVs. If they were able to sell a total of 56 TVs, how many OLED TVs were able to sell? This figure will guide the next order from the supplier.",
    "gold_num": "35"
  },
  {
    "question": "During a wildlife census, detailed counts are recorded daily. A zookeeper is counting how many lions are in their enclosure. She counts 20 female lions, half as many male lions, and 18 lion cubs. How many lions are in the enclosure? She will log this total in the conservation database.",
    "gold_num": "48"
  },
  {
    "question": "In preparation for back-to-school shopping, Mike tracked his spending carefully. Mike needed a new pair of jeans. When he got to the mall he saw that his favorite jeans were advertised 30% off. The original price of the jeans was $60. How much money will Mike have left over if he pays with a $100 bill? He will note the remainder in his budget planner.",
    "gold_num": "58"
  },
  {
    "question": "In their daily operations, the bakery staff calculates cost differences to adjust their specials. A loaf of bread at the bakery costs $3. Bagels cost $2 each. How much more do 5 loaves of bread cost than 4 bagels? This information will factor into the morning promotions.",
    "gold_num": "7"
  },
  {
    "question": "Before starting his next art piece, Milo carefully calculates his needed materials. Milo is making a mosaic with chips of glass. It takes 15 glass chips to make every square inch of the mosaic. A bag of glass chips holds 150 chips. Milo wants his mosaic to be 5 inches tall. If he has 3 bags of glass chips, how many inches long can he make his mosaic? This calculation will ensure his design fits the display frame.",
    "gold_num": "6"
  },
  {
    "question": "To balance his farm expense records, John tallied his recent livestock purchases. John goes to the market and buys 4 goats for $600 each and 3 cows for $2000 each. How much money did he spend? He will enter this total into his financial ledger.",
    "gold_num": "8400"
  },
  {
    "question": "Hunter noticed a busy morning at his school parking lot and decided to count the cars. When he arrived, there were 80 cars parked. During the first break, he saw that 35 more cars had arrived. By the time he came out for lunch, he realized that half of the cars currently in the lot had left. How many cars did Hunter count in the parking lot during lunch break?",
    "gold_num": "57"
  },
  {
    "question": "Kimberly went shopping for her pets and bought 12 packages of cat food and 10 packages of dog food. Each package of cat food contained 14 tins, and each package of dog food contained 8 tins. After unpacking her groceries, how many more tins of cat food than dog food did Kimberly buy?",
    "gold_num": "68"
  },
  {
    "question": "Roy has managed to save 60% more money from chores than his brother Anthony. Anthony, in turn, has saved $15 more than their sister Eva. If Eva has saved $30, how much money does Roy have?",
    "gold_num": "72"
  },
  {
    "question": "Mason loves long-distance cycling. He rides at a steady pace of 12 miles per hour. On a recent trip, he cycled for 6 hours, took a break, and then continued for another 8 hours. How many miles did Mason travel in total on his journey?",
    "gold_num": "168"
  },
  {
    "question": "Jada, Rory, and Kora are making clay dishes for their school art project. Jada makes three times as many dishes as Rory, and Rory makes 30 more dishes than Kora. If Kora made 30 dishes, how many clay dishes did they make together?",
    "gold_num": "270"
  },
  {
    "question": "Adam is preparing a fruit platter. A large apple can be sliced into 7 pieces, and a small apple into 4 pieces. Adam slices 5 large apples and 8 small apples, then eats 20 slices. How many apple slices are left?",
    "gold_num": "51"
  },
  {
    "question": "Craig has 3 fifty dollar bills. He buys 10 squirt guns for $4 each and 6 packs of water balloons for $5 each. After his shopping spree, how much money does Craig have left?",
    "gold_num": "92"
  },
  {
    "question": "A clothing store has 70 white shirts and 90 floral shirts. Half of the white shirts have collars, and 40 of the floral shirts have buttons. How many more floral shirts with no buttons are there than white shirts with no collars?",
    "gold_num": "25"
  },
  {
    "question": "Gretchen is organizing her coin collection. She has 50 more gold coins than silver coins. If she has 120 gold coins, how many coins does Gretchen have in total?",
    "gold_num": "190"
  },
  {
    "question": "A bumper car rink has 18 red cars. They have 4 fewer green cars than red cars. The number of blue cars is 4 times the number of green cars. The rink also has yellow cars. If there are 145 cars in total, how many yellow cars are there?",
    "gold_num": "47"
  },

  {"question": "Daisy went to the farmer's market and bought a bag of potatoes weighing 8 pounds. She also picked up a bag of sweet potatoes that weighed 3 times as much as the potatoes, and a bag of carrots that weighed 5 pounds fewer than the sweet potatoes. How many pounds of carrots did Daisy buy to complete her shopping?",
   "gold_num": "19"
  },

  {"question": "Ella recently started a dog walking business and earned $56 for 4 hours of work. If she continues to walk dogs at the same hourly rate, how much would she earn after 16 hours of walking?",
   "gold_num": "224"
  },

  {"question": "The Ben and Aggie Burrito Shop is famous for its chimichangas. On Mondays, they make 180 chimichangas, on Tuesdays, another 180, and on Fridays, they make three times as many as on Tuesday. How many chimichangas do they make on these three days combined?",
   "gold_num": "900"
  },

  {"question": "John rents his car out 15 times a month for 4 hours each time. He earns $40 per hour. If his monthly car payment is $1200, how much profit does he make from renting out his car?",
   "gold_num": "1200"
  },

  {"question": "Dijana and Anis love rowing on the lake every weekend. One Sunday, Dijana rowed for 80 miles. Anis rowed 1/4 times more miles than Dijana. What is the total distance both of them rowed that day?", 
  "gold_num": "180"
  },

  {"question": "Susan baked 150 cookies for the holidays and planned to share them equally among her 8 nephews. Before she could divide them, her husband sneaked 6 cookies for himself. How many cookies will each nephew receive?", 
  "gold_num": "18"
  },

  {"question": "The educational shop is selling notebooks for $2.00 each and a ballpen for $1.00 each. William bought seven notebooks and two ballpens. How much did he spend in total?",
   "gold_num": "16"
  },

  {"question": "There are 12 Fast and the Furious movies, and Deepa has seen each one in the theatre four times. She has spent $384 seeing these movies. What is the average price she paid per ticket?",
   "gold_num": "8"
  },

  {"question": "Sarah has 14 books, and Joseph had three times as many books as Sarah, but he lost 5 of them. How many books does Joseph currently have?", 
  "gold_num": "37"
  },
  {"question": "Dean has 50 marbles. He gives 1/5 of them to Jamie and gives 15 to Donald. How many marbles are left for Dean?",
   "gold_num": "25"
  },

  {"question": "Farmer Brown's farm is 350 acres, and Farmer Smith's farm is 150 acres more than twice that. How many acres do the two farms have together?",
   "gold_num": "1200"
  },
  {"question": "Jon's car needs a tune-up every 2000 miles. He drives 150 miles a day for a 40 day month. How many tune-ups does he need in that time?",
   "gold_num": "3"
  },

  {"question": "Bruce works for 7 hours on Tuesday. On Wednesday, he works three times the hours he worked on Tuesday. On Thursday, he works 3 hours less than he did on Wednesday. How many hours does Bruce work in total over these three days?",
   "gold_num": "46"
  },

  {"question": "Kira bought 6 apples, 8 bananas, and 10 oranges at the grocery store. Lola ate 4 pieces of the fruit. How many pieces are left for Kira?",
   "gold_num": "20"
  },

  {"question": "A loaf of bread has 36 slices. If Abby eats 3 slices a day and Josh eats three times as much, how many days will the loaf of bread last?",
   "gold_num": "3"
  },

  {"question": "A charity group is organizing a yard sale. 15 people each donate 8 boxes of items, and they already have 20 boxes. If they can fit 4 boxes per table and already own 20 tables, how many new tables do they need?",
   "gold_num": "15"
  },

  {"question": "Craig and his brother love spelling long words and counting the letters. After twelve rounds, Craig has spelled 24 words with 18 letters each. His brother has spelled words with a total letter count that is 72 more than Craig. What is the total number of letters in the words they have spelled after twelve rounds?",
   "gold_num": "936"
  },
  {
    "question": "Jen has been working hard for months to harvest and sell her root crops. She now has 12 yams that can be sold at $2 each, 20 sweet potatoes worth $3 each, and 8 carrots that go for $1 each. How much will she earn if she sells all of them?",
    "gold_num": "92"
  },
  {
    "question": "Jasmine is collecting stickers from her teacher over the course of a week. She received 20 stickers for class participation, lost 8 during lunch, and later got 6 more for helping her classmates. How many stickers does she have now?",
    "gold_num": "18"
  },
  {
    "question": "Marcus was chatting with his cousins and said he is half of Leo’s age and six years younger than Deanna. If Deanna is 36 years old, how old is Leo?",
    "gold_num": "60"
  },
  {
    "question": "Jonathan is organizing his kitchen tools. He owns 2/3 as many measuring spoons as cups. He originally had 30 measuring cups, but gave 10 spoons to a friend. How many total utensils does he have now?",
    "gold_num": "40"
  },
  {
    "question": "Jen has budgeted for a journey to 5 different countries. She spent $800 on supplies. The total travel cost, including all tickets, was 75% more than what she spent on supplies. What is the total cost of travel?",
    "gold_num": "1400"
  },
  {
    "question": "John recently began binge-watching a new series that everyone at school is talking about. Each episode lasts 25 minutes, and the total number of episodes is equal to half the length in minutes of a single episode. If he watches the entire season, how many minutes will he spend watching?",
    "gold_num": "312"
  },
  {
    "question": "Nani is 10 years old. His older brother is twice his age, while his sister is 30% younger than him. What is the combined total of their ages? Round your thinking carefully before answering.",
    "gold_num": "39"
  },
  {
    "question": "Zeke and Carlton play for different baseball teams. Zeke's team has 9 more players than Carlton's, and Carlton’s team has 14 players. What’s the total number of players on both teams together? Imagine they’re forming a league.",
    "gold_num": "37"
  },
  {
    "question": "Adrianne is preparing a jewelry set and collecting beads from friends and family. Her mom gave her 25 metallic beads. Her sister gave her 10 more than that, and her best friend gave her double the amount her mom gave. How many beads does Adrianne now have in total for her project?",
    "gold_num": "110"
  },
  {
    "question": "Joe is getting ready for a weekend seafood feast. He caught 5 pounds of crawfish on Thursday, then four times that on Friday, and on Saturday he caught half as much as he did on Friday. If one serving equals 3 pounds, how many full servings does Joe have altogether?",
    "gold_num": "13"
  },
  {
    "question": "Charlie’s boots are enormous compared to Sophie’s — exactly 6 times larger. If Sophie wears a size 4 boot, what is the average shoe size between the two? Think about the meaning of 'average'.",
    "gold_num": "14"
  },
  {
    "question": "Edgar loves pretzels and eats 24 of them each day without fail. His brother eats half that amount. How many pretzels does his brother consume in a full 7-day week?",
    "gold_num": "84"
  },
  {
    "question": "Mrs. Tatiana manages a supermarket that adjusts prices annually. The price of carrots rises by 6% of the original value every year. If the original price was $150, what will the final price be after 3 years? Round your answer to the nearest whole number.",
    "gold_num": "177"
  },
  {
    "question": "It was a hectic Saturday at the Grand River Hotel, which was fully occupied with 120 guests. That morning, 30 guests left early, and 18 chose to leave later than usual. In the afternoon, twice as many people checked in as there were late checkouts, and 10 more guests arrived after dinner. What’s the total number of guests currently staying at the hotel?",
    "gold_num": "110"
  },
  {
    "question": "John picked 5 bananas on Wednesday. On Thursday, he added 7 more to his collection. On Friday, he gathered three times the number he picked on Wednesday. How many bananas does he have in total now?",
    "gold_num": "27"
  },
  {
    "question": "A skilled dwarf can extract 15 pounds of ore per day using only his hands. With an iron pickaxe, he doubles that amount. When upgraded to a steel pickaxe, he mines 50% more than with the iron one. How much ore can a group of 50 dwarves with steel pickaxes collect in 30 days?",
    "gold_num": "67500"
  },
  {
    "question": "Every weekend, Jill and her group of friends enjoy watching movies as a tradition. They usually watch 6 movies on Saturday and half that number on Sunday. Assuming they keep up this routine for 5 consecutive weeks, how many movies will they have watched in total?",
    "gold_num": "45"
  },
  {
    "question": "Leo has a growing sticker collection. Two years ago, he had 120 stickers. Last year, he added 60 more. This year, he doubled the amount he collected last year. Considering all these years, how many stickers has Leo gathered in total?",
    "gold_num": "300"
  },
  {
    "question": "Melanie is determined to build a sculpture she saw online, which needs 240 toothpicks. Over the past 15 weeks, she has saved 10 toothpicks per week from her lunches. If she keeps collecting at the same pace, how many more weeks does she need to complete her goal?",
    "gold_num": "9"
  },
  {
    "question": "James walked to the local store to grab groceries. After walking halfway there, he realized he left his wallet at home and had to return. If his home is 5 miles from the store and he walks at 5 miles per hour, how long did it take him to finally reach the store?",
    "gold_num": "2"
  },
  {
    "question": "Sam and Harry are sharing a long wooden fence that totals 120 feet. If Harry takes 80 feet of it, how much of the fence does Sam get?",
    "gold_num": "40"
  },
  {
    "question": "Nathan dropped his bouncy ball from the fourth floor of a tall building, with each floor being 24 feet high. The ball bounces to 2/3 of its previous height on every bounce. How high does it go on the second bounce?",
    "gold_num": "51"
  },
  {
    "question": "At a popular farmers market, an apple orchard sells apples in bags containing 10 apples each. If they sold a total of 2500 apples in one day at $6 per bag, how much money did they make?",
    "gold_num": "1500"
  },
  {
    "question": "Two trains depart from the same station but travel in opposite directions. One of them moves at 80 miles per hour, while the other goes at half that speed. How far apart will they be after 4 hours of travel?",
    "gold_num": "480"
  },
  {
    "question": "Mary and John celebrated their wedding last Saturday. Outside the venue, there were 25 private cars and 15 buses parked. If each bus carried 40 guests and each car carried 4 people, how many people attended the event?",
    "gold_num": "760"
  },
  {
    "question": "Jeff is 12 years older than his younger sister, Martha. Martha is 5 years younger than her boyfriend, Mike. If Mike is 26 years old, how old is Jeff?",
    "gold_num": "33"
  },
  {
    "question": "Amber, Micah, and Ahito completed a group ultramarathon. Together they ran 65 miles. Amber contributed 10 miles. Micah ran 4 times what Amber did. How many miles did Ahito cover?",
    "gold_num": "15"
  },
  {
    "question": "Caroline is four times older than Ben. Ben is three times older than Chris. If Chris is 5 years old, how old is Caroline?",
    "gold_num": "60"
  },
  {
    "question": "Marty has a ribbon that is 120 centimeters long. He cuts it into 6 equal sections. Then, each section is divided into 4 equal smaller parts. What is the length of each final piece?",
    "gold_num": "5"
  },
  {
    "question": "At the garden center, my mom bought a new planter for $24 and a decorative stone set for $31. She had a $9 discount coupon. How much did she pay at the end?",
    "gold_num": "46"
  },
  {
    "question": "Raymond had $30 in his wallet. He saved $14 from chores and spent $6 on snacks and $20 on a new toy. How much money does Raymond still have left?",
    "gold_num": "18"
  },
  {
    "question": "Last year, a painting class had 60 students enrolled. This year, enrollment increased by 25%. How many students are now enrolled in the class?",
    "gold_num": "75"
  },
  {
    "question": "Rani is fascinated by fast cars. She finds out the fastest model ever made is 1.5 times faster than the second-fastest, which is itself 6 times faster than a regular car. If a regular car travels at 110 miles per hour, what is the speed of the fastest car?",
    "gold_num": "990"
  },
  {
    "question": "John decides to cut down a tall 100-foot tree from his backyard. He’s able to use 90% of it to make usable logs, each 5 feet long. From every log, he cuts 6 planks, and he sells each plank for $1.5. How much money does John earn from selling all the planks?",
    "gold_num": "162"
  },
  {
    "question": "Chester sticks to a protein-rich diet. For the first 30 days, he eats 4 eggs daily. Then he increases to 6 eggs per day for the next 30 days. How many dozens of eggs does Chester consume over these 60 days?",
    "gold_num": "25"
  },
  {
    "question": "Tim planted 6 lemon trees in his backyard. Every year, each tree yields 8 lemons. How many lemons does he harvest over the course of 10 years?",
    "gold_num": "480"
  },
  {
    "question": "Mason includes carrots in his diet daily. He eats 5 carrots from Monday to Friday and 6 carrots on each weekend day. What’s the total number of carrots he consumes weekly?",
    "gold_num": "37"
  },
  {
    "question": "John buys a vintage cassette with 2 songs. The first one lasts 6 minutes, and the second one is 75% longer than the first. What’s the total playtime of the cassette?",
    "gold_num": "16"
  },
  {
    "question": "Tyrion is very cautious about hygiene. He changes his mask three times each time he steps out, and he usually goes out twice a day. How many masks will he use over 3 days?",
    "gold_num": "18"
  },
  {
    "question": "Jack had $120 in savings. Sophia decided to help and gave him 1/4 of her $120. How much money does Jack have now?",
    "gold_num": "150"
  },
  {
    "question": "Ronnie received $6 as a gift, while Rissa got three times that amount. After they each gave away the same amount to their younger sibling, Rissa was left with 4/5 of her total. How much does Ronnie have left?",
    "gold_num": "3"
  },
  {
    "question": "Miss Albert’s class includes 14 boys and 14 girls. One-half of the girls and one-third of the boys are on the varsity team. How many students are *not* in varsity?",
    "gold_num": "16"
  },
  {
    "question": "Sam set a new fitness goal this week. He ran 4 miles on Monday, Wednesday, and Friday. On Tuesday and Thursday, he increased the pace and ran 6 miles each day. What is the total number of miles Sam ran this week?",
    "gold_num": "24"
  },
  {
    "question": "Fred was organizing a barbecue to take place in five days. On the first day, he brewed 30 gallons of root beer and stored them in a cooler. That night, his kids drank 5 gallons. On the second day, his wife accidentally spilled 8 gallons. On the third day, his cousin drank another 6 gallons. On the fourth day, Fred and four guests split the remaining root beer evenly. How many gallons did each person get?",
    "gold_num": "2.2"
  },
  {
    "question": "Ten more than five times the number of coffee mugs in the office kitchen equals 60. How many coffee mugs are there?",
    "gold_num": "10"
  },
  {
    "question": "John, an experienced carpenter, helped his neighbor Ali by building 5 wooden tables at $25 each and 3 roof frames at $15 each. How much does Ali owe John for all the work?",
    "gold_num": "170"
  },
  {
    "question": "Luke is redesigning his living room curtains. There are six windows, each 40 inches wide. He needs fabric that is double the combined width of all windows. How many inches of fabric should Luke buy?",
    "gold_num": "480"
  },
  {
    "question": "It rained 3 inches on Monday. The forecast predicts that Tuesday will bring 1 inch more than twice Monday’s rainfall. How many inches of rain are expected on Tuesday?",
    "gold_num": "7"
  },
  {
    "question": "In October, a tech gadget cost $50. In November, the price rose by 90%. In December, it dropped by 40%. What is the final price of the gadget after these changes?",
    "gold_num": "63"
  },
  {
    "question": "On a snowy Monday, 17 of the  ninety-five teachers at Maplewood Elementary called in sick. Luckily, 11 substitute teachers were available to fill in. How many teachers were physically present at the school that day?",
    "gold_num": "89"
  },
  {
    "question": "Four years ago, Ara joined the varsity basketball team. She's played 38 games each season, and her average score per game is 24 points. What’s the total number of points Ara has accumulated over the years?",
    "gold_num": "3648"
  },
  {
    "question": "Mitchell is preparing nachos for movie night with his family. He buys three bags of tortilla chips, each containing 48 chips. If there are 6 people sharing equally, how many chips does each person receive?",
    "gold_num": "24"
  },
  {
    "question": "Louise is testing a new varnish formula. The older varnish dried in just 6 minutes per painting, but the new one takes 14 minutes. If she's coating 5 paintings, how much more total drying time will the new varnish require compared to the old one?",
    "gold_num": "40"
  },
  {
    "question": "Bob wants to build a replica of the Eiffel Tower using popsicle sticks. He estimates needing 72 sticks. The popsicles come 9 per box, and each box costs $2.50. How much will Bob spend to complete the project?",
    "gold_num": "20"
  },
  {
    "question": "A tower sculpture uses 5 blue blocks, double that number of green blocks, and the rest are orange blocks. If the total block count is 41, how many blocks are orange?",
    "gold_num": "26"
  },
  {
    "question": "Elvis set off on a road trip heading south for 4.5 hours. Later that day, he turned around and drove north for 9.5 hours at a steady pace of 20 miles per hour both ways. How far from home is Elvis now?",
    "gold_num": "100"
  },
  {
    "question": "Steve completed a 1,000-piece puzzle in 12 hours over the weekend. Anna tried the same puzzle but finished it in 3 hours more than half of Steve’s time. How many hours did Anna take?",
    "gold_num": "9"
  },
  {
    "question": "Timothy owns four times as many pens as George. Sarah, on the other hand, has one-third the number of pens that Timothy has. If George has 21 pens, how many pens does Sarah own?",
    "gold_num": "28"
  },
  {
    "question": "Janet visited the shopping center and spent $4.25 on a smoothie, $9.25 each for movie tickets for herself and her best friend, and $10.75 on a necklace. If her parents gave her $50 for the day, how much money does she still have left?",
    "gold_num": "17.5"
  },
  {
    "question": "Matthew owns a collection of 14 rare toy robots. He plans to sell half of them at $6 per piece, and the rest at $9 per piece. If he accepts the deal, how much will he earn in total?",
    "gold_num": "105"
  },
  {
    "question": "Jefferson High School registers 4800 students each year. Nearby, Lincoln High School registers 5/8 as many students. By how many students does Jefferson's enrollment exceed Lincoln’s?",
    "gold_num": "1800"
  },
  {
    "question": "James is assembling 5 tables for a school event. Every table requires 3 legs, and each leg takes 3 screws to fasten. If he has 60 screws in total, how many screws will remain unused after building the tables?",
    "gold_num": "15"
  },
  {
    "question": "There are 12 eggs in one basket, while a second basket holds three times as many. How many eggs are there in both baskets together?",
    "gold_num": "48"
  }
]