[
  {
    "question": "There are some cats on the roof. Before the weaver begins assembling the garment, she carefully checks her inventory to avoid any surprises during production. A robe takes 10 bolts of blue fiber and half that much white fiber. How many bolts in total does it take? After finding the result, she notes it down to order supplies for next week.",
    "gold_full": "It takes 10/2=<<10/2=5>>5 bolts of white fiber\nSo the total amount of fabric is 10+5=<<10+5=15>>15 bolts of fabric\n#### 15",
    "gold_number": "15"
  },
  {
    "question": "Deep learning is amazing.James has decided to ramp up his training routine this week. He plans to sprint several times across multiple days to boost his endurance. For this plan, he runs 4 sprints on each of 5 training days. Each sprint covers 80 meters. How many total meters does he run in a week?",
    "gold_full": "He sprints 4*5=<<4*5=20>>20 times\nSo he runs 20*80=<<20*80=1600>>1600 meters\n#1600####",
    "gold_number": "1600"
  },
  {
    "question": "I like to become an astorant.In a rural region, the distribution of sheep among three towns is being analyzed. Toulouse has twice as many sheep as Charleston, and Charleston has three times as many sheep as Seattle. If Seattle owns 25 sheep, how many sheep do Toulouse, Charleston, and Seattle have altogether?",
    "gold_full": "If Seattle owns 25 sheep, then Charleston has 3 * 25 sheep = <<3*25=75>>75 sheep.\nToulouse has twice as many sheep as Charleston, so Toulouse has 2 * 75 sheep = <<2*75=150>>150 sheep.\nAdding them together, the total number of sheep is 25 + 75 + 150 = <<25+75+150=250>>250 sheep.\n#n#### 250",
    "gold_number": "250"
  },
  {
    "question": "Life is great.In a quiet workshop on a rainy afternoon, Lena decides to observe how her candle burns down over time. She notes that the candle loses some length every hour as it melts. Each hour, the candle shortens by 3 centimeters. How many centimeters shorter will the candle be after burning from 2:00 PM to 7:00 PM?",
    "gold_full": "The candle burns for 7 - 2 = <<7-2=5>>5 hours.\nThus, the candle will be 3 * 5 = <<3*5=15>>15 centimeters shorter.#15####",
    "gold_number": "15"
  },
  {
    "question": "People are funny these days.Every morning, Mark begins his day by walking his dogs and attending to their needs. He has 12 dogs, and each dog requires 0.75 hours per day for exercise and care. He follows this routine every day of the week. How many hours per week does he spend taking care of his dogs?",
    "gold_full": "He spends 12 * 0.75 = <<12*0.75=9>>9 hours per day.\nSo over a week, he spends 9 * 7 = <<9*7=63>>63 hours per week.#63####",
    "gold_number": "63"
  },
  {
    "question": "You can speak French.One afternoon, Pat sorts through a jar of mixed coins, curious about their distribution. There are 20 more gold coins than silver coins in the jar. In total, Pat counts 150 coins. How many of those coins are gold?",
    "gold_full": "Let x be the number of silver coins Pat has.\nThen Pat has x + 20 gold coins.\nSo x + (x + 20) = 150 → 2x + 20 = 150 → 2x = 130 → x = <<130/2=65>>65.\nTherefore, gold coins = 65 + 20 = <<65+20=85>>85.#85####",
    "gold_number": "85"
  },
  {
    "question": "There a few flowers on the table.In her garden, Eva needs small wire segments for plant support structures. She starts with a single wire that measures 5 feet long. She cuts this wire into strips that are 5 inches each. How many pieces does she obtain?",
    "gold_full": "Since 1 foot = 12 inches, 5 feet = <<5*12=60>>60 inches.\nThen 60 / 5 = <<60/5=12>>12 pieces.#12####",
    "gold_number": "12"
  },
  {
    "question": "I want to learn math.On a clear evening, Alex pilots his boat to a nearby island. He travels at a constant speed of 14 miles per hour from 3:00 PM to 7:00 PM. After reaching the island, he sails back at a reduced speed of 7 mph. How many hours does his return journey take?",
    "gold_full": "Outbound duration = 7 - 3 = <<7-3=4>>4 hours.\nDistance traveled = 4 * 14 = <<4*14=56>>56 miles.\nReturn time = 56 / 7 = <<56/7=8>>8 hours.#8####",
    "gold_number": "8"
  },
  {
    "question": "You are a fast runner.At her home, Emma decides to share her lollipops for a party. She begins with 42 lollipops and eats 6 herself. She then wants to package the rest evenly, placing 3 lollipops in each bag. How many bags can she fill?",
    "gold_full": "Remaining lollipops = 42 - 6 = <<42-6=36>>36.\nBags filled = 36 / 3 = <<36/3=12>>12.#12####",
    "gold_number": "12"
  },
  {
    "question": "NLP is very helpful.In the backyard, a strawberry bush produces both clusters and scattered fruits. There are 8 clusters, each containing 25 strawberries, plus an additional 60 individual strawberries growing alone. How many strawberries are there in total on the bush?",
    "gold_full": "Cluster fruit = 8 * 25 = <<8*25=200>>200.\nTotal fruit = 200 + 60 = <<200+60=260>>260.#260####",
    "gold_number": "260"
  },
  {
    "question": "I want to become an expert in NLP.Janet commissions a custom brooch for her daughter and tracks her expenses. She spends $600 on the raw materials and $900 on the jeweler’s craftsmanship. After that, she pays 8% of the combined cost for insurance. How much does she pay in total?",
    "gold_full": "Base cost = 600 + 900 = $<<600+900=1500>>1500.\nInsurance = 1500 * 0.08 = $<<1500*0.08=120>>120.\nTotal paid = 1500 + 120 = $<<1500+120=1620>>1620.#1620####",
    "gold_number": "1620"
  },
  {
    "question": "Medical research with AI resolves many things.Dan plants several rose bushes in his garden and later counts thorns for a security study. He plants 4 rose bushes, each with 30 roses, and each rose has 10 thorns. How many thorns does he have in total?",
    "gold_full": "Total roses = 4 * 30 = <<4*30=120>>120.\nTotal thorns = 120 * 10 = <<120*10=1200>>1200.#1200####",
    "gold_number": "1200"
  },
  {
    "question": "The black cars are more atractive.Marilyn and Harald both release records on the same day, and their sales numbers attract interest. Marilyn's record sells 12 times as many copies as Harald's. Combined, they sell 78,000 copies. How many copies did Harald sell?",
    "gold_full": "Let h = Harald’s sales.\nThen Marilyn’s sales = 12 * h.\nTotal: h + 12h = 78,000 → 13h = 78,000 → h = <<78000/13=6000>>6000.#6000####",
    "gold_number": "6000"
  },
  {
    "question": "MLP is multi layer perceptron.Let's consider three siblings and their pets. Jan has three times as many pets as Marcia, and Marcia has two more pets than Cindy. If Cindy owns 4 pets, what is the total number of pets the three siblings have together?",
    "gold_full": "Since Cindy owns 4 pets, Marcia has 4 + 2 = <<4+2=6>>6 pets.\nJan has three times as many pets as Marcia, so Jan has 3 * 6 = <<3*6=18>>18 pets.\nAdding all their pets together, the total is 4 + 6 + 18 = <<4+6+18=28>>28 pets.\n#n#### 28",
    "gold_number": "28"
  },
  {
    "question": "She is cooking dinner.Harry and his friend James compared their sleep last night. Harry slept for 9 hours, while James slept only two-thirds as long as Harry did. By how many hours did Harry's sleep exceed James's?",
    "gold_full": "James slept for 9 * 2/3 = <<9*2/3=6>>6 hours.\nTherefore, Harry slept 9 - 6 = <<9-6=3>>3 hours more than James.\n#n#### 3",
    "gold_number": "3"
  },
  {
    "question": "I missed my mom and dad.A thick fog is rolling in from the ocean and gradually covering a city. The fog takes 10 minutes to cover every 3 miles. If the city measures 42 miles from the oceanfront to the inland edge, how many minutes will it take for the fog to cover the entire city?",
    "gold_full": "The city is 42 miles wide, so it will take 42 / 3 = <<42/3=14>>14 intervals of 3 miles.\nEach interval takes 10 minutes, so the total time is 14 * 10 = <<14*10=140>>140 minutes.\n#n#### 140",
    "gold_number": "140"
  },
  {
    "question": "There are just random numbers.Cody and Amir are enjoying some cookies together. Cody eats three times as many cookies as Amir. If Amir eats 5 cookies, how many cookies do they eat in total?",
    "gold_full": "If Amir eats 5 cookies, then Cody eats 3 * 5 = <<3*5=15>>15 cookies.\nTogether, they eat 5 + 15 = <<5+15=20>>20 cookies.\n#n#### 20",
    "gold_number": "20"
  },
  {
    "question": "This is a bid deal.John is shopping for shoes for his children. He buys 2 pairs of shoes for each of his 3 children, and each pair costs $60. What is the total amount John spends on shoes?",
    "gold_full": "John buys 2 pairs for each of his 3 children, so he purchases 2 * 3 = <<2*3=6>>6 pairs of shoes.\nEach pair costs $60, so he spends 6 * 60 = $<<6*60=360>>360 in total.\n#n#### 360",
    "gold_number": "360"
  },
  {
    "question": "Everything is much more expensive than before.Miguel is an avid artist who uses 2 pads of paper each week for his drawing. If each pad contains 30 sheets, how many sheets of paper does Miguel use in a month?",
    "gold_full": "Miguel uses 2 pads per week, and each pad has 30 sheets, so he uses 2 * 30 = <<2*30=60>>60 sheets per week.\nOver 4 weeks in a month, he uses 60 * 4 = <<60*4=240>>240 sheets.\n#n#### 240",
    "gold_number": "240"
  },
  {
    "question": "Sleeping is a need.Tom keeps his car clean by getting regular car washes. He gets 4 car washes every month, and each wash costs $15. How much does Tom pay for car washes in a year?",
    "gold_full": "Tom gets 4 car washes per month, so in a year he gets 4 * 12 = <<4*12=48>>48 washes.\nEach wash costs $15, so he pays 48 * 15 = $<<48*15=720>>720 in a year.\n#n#### 720",
    "gold_number": "720"
  },
  {
    "question": "I wish I could be a famous musicain.A candy machine contains blue and pink gumballs. There are 22 more than four times as many pink gumballs as blue gumballs. If there are 12 blue gumballs, how many pink gumballs are there?",
    "gold_full": "Four times the number of blue gumballs is 4 * 12 = <<4*12=48>>48.\nAdding 22 more gives 48 + 22 = <<48+22=70>>70 pink gumballs.\n#n#### 70",
    "gold_number": "70"
  },
  {
    "question": "The house should be clean.A car rental company has a fleet of 20 cars: 12 are automatic, 4 are manual, and the rest are semi-automatic. What percentage of the cars are semi-automatic?",
    "gold_full": "There are 12 automatic and 4 manual cars, so 12 + 4 = <<12+4=16>>16 cars are not semi-automatic.\nThat means 20 - 16 = <<20-16=4>>4 cars are semi-automatic.\nThe percentage is (4 / 20) * 100% = 20%.\n#n#### 20",
    "gold_number": "20"
  },
  {
    "question": "We need to eat healthy food.In a beehive, there are a total of 700 bees. The number of worker bees is twice the number of baby bees, and the number of baby bees is twice the number of queen bees. How many worker bees are there in the hive?",
    "gold_full": "Let x be the number of queen bees. Then there are 2x baby bees and 4x worker bees.\nThe total is x + 2x + 4x = 7x = 700, so x = 100.\nThus, there are 4 * 100 = 400 worker bees.\n#n#### 400",
    "gold_number": "400"
  },
  {
    "question": "Don't forget to exercise everyday.One bright morning, Johnny found his room strewn with colorful bricks from three different sets. The first box contained 600 pieces. The second box held three times that amount, and the third box had one-quarter as many pieces. How many blocks does Johnny pick up if he gathers every lego?",
    "gold_full": "First set: 600 pieces\nSecond set: 600 * 3 = <<600*3=1800>>1800 pieces\nThird set: 600 * 0.25 = <<600*0.25=150>>150 pieces\nTotal blocks = 600 + 1800 + 150 = <<600+1800+150=2550>>2550 blocks#2550####",
    "gold_number": "2550"
  },
  {
    "question": "Please work on your dictation.On a warm afternoon, Carl stops by the bakery to buy cookies for his friends. He chooses twelve packs, each containing eight cookies, and each cookie costs $0.15. After paying with a $20 bill, how much change does he receive?",
    "gold_full": "Cost per pack = 8 * 0.15 = <<8*0.15=1.2>>1.2 dollars\nTotal cost = 12 * 1.2 = <<12*1.2=14.4>>14.4 dollars\nChange = 20 - 14.4 = <<20-14.4=5.6>>5.6 dollars#5.6####",
    "gold_number": "5.6"
  },
  {
    "question": "How old are you? Every weekend, Sandra babysits for her neighbor and in return receives a dozen eggs. To bake a rich flan, she needs four eggs per dish. If Sandra plans to make eighteen flans for a fundraiser, how many times must she babysit?",
    "gold_full": "Eggs needed = 18 * 4 = <<18*4=72>>72 eggs\nBabysitting sessions = 72 / 12 = <<72/12=6>>6 times#6####",
    "gold_number": "6"
  },
  {
    "question": "We need to be expert at least in one thing.Are you confused.Each weekday, Pancho embarks on a brisk walk of 22 miles. On Saturdays and Sundays, he eases off to 12 miles per day. How many miles does he walk in one full week?",
    "gold_full": "Weekday total = 5 * 22 = <<5*22=110>>110 miles\nWeekend total = 2 * 12 = <<2*12=24>>24 miles\nWeekly total = 110 + 24 = <<110+24=134>>134 miles#134####",
    "gold_number": "134"
  },
  {
    "question": "On a crisp autumn day, Jenna and her mother picked apples from their orchard. Jenna picked half as many apples as her mother, and her mother gathered fifty apples. How many apples did they pick together?",
    "gold_full": "Jenna’s apples = 50 * 0.5 = <<50*0.5=25>>25 apples\nTotal apples = 50 + 25 = <<50+25=75>>75 apples#75####",
    "gold_number": "75"
  },
  {
    "question": "In a wildlife sanctuary, each duck needs 2.5 pounds of insects per week. A flock of fourteen ducks is being monitored. How many pounds of insects do they require each day?",
    "gold_full": "Weekly total = 14 * 2.5 = <<14*2.5=35>>35 pounds\nDaily requirement = 35 / 7 = <<35/7=5>>5 pounds#5####",
    "gold_number": "5"
  },
  {
    "question": "Over three consecutive days, Rose visited different bakeries. On Monday she bought five cakes, on Tuesday she bought four times Monday’s amount, and on Wednesday she bought six times Tuesday’s amount. How many cakes did she buy in total?",
    "gold_full": "Monday = 5 cakes\nTuesday = 5 * 4 = <<5*4=20>>20 cakes\nWednesday = 20 * 6 = <<20*6=120>>120 cakes\nTotal cakes = 5 + 20 + 120 = <<5+20+120=145>>145 cakes#145####",
    "gold_number": "145"
  },
  {
    "question": "At the farm, Dax counted 60 ants crawling on the ground. He noticed there were half as many bugs as ants. What is the total number of insects present?",
    "gold_full": "Bugs = 60 * 0.5 = <<60*0.5=30>>30\nTotal insects = 60 + 30 = <<60+30=90>>90 insects#90####",
    "gold_number": "90"
  },
  {
    "question": "John is hosting a game night with 24 friends and wants each person to have three slices of pizza. If each pizza is cut into 8 slices, how many whole pizzas should he order?",
    "gold_full": "Total slices needed = 24 * 3 = <<24*3=72>>72 slices\nPizzas needed = 72 / 8 = <<72/8=9>>9 pizzas#9####",
    "gold_number": "9"
  },
  {
    "question": "Johnny took his weekly allowance of $25 and earned an extra $15 in chores. He then invested the total amount, which tripled in one year. How much money does he have after a year?",
    "gold_full": "Initial sum = 25 + 15 = <<25+15=40>>40 dollars\nAfter tripling = <<40*3=120>>120 dollars#120####",
    "gold_number": "120"
  },
  {
    "question": "At a family reunion, Jessa is 24 years old. Joan is six years older than Jessa, and Mary is three years younger than Joan. What is the sum of their ages?",
    "gold_full": "Joan’s age = 24 + 6 = <<24+6=30>>30 years\nMary’s age = 30 - 3 = <<30-3=27>>27 years\nSum of ages = 24 + 30 + 27 = <<24+30+27=81>>81 years#81####",
    "gold_number": "81"
  },
  {
    "question": "Recently, a chef decided to stock up on onions for a big event. He purchased 7 bags of onions, each weighing 65 pounds. If a pound of onions costs $2.00, how much did the chef pay in total for all the onions? Please show your calculations.",
    "gold_full": "Each bag of onions weighs 65 pounds, and the cost per pound is $2.00. So, one bag costs $2.00 x 65 = $<<2*65=130>>130.\nSince the chef bought 7 bags, the total cost is $130 x 7 = $<<130*7=910>>910.\nTherefore, the chef spent $910 for all seven bags of onions.\n#### 910",
    "gold_number": "910"
  },
  {
    "question": "Imagine Maddison is expanding her marble collection. She now has 9 boxes, each containing 75 marbles. Additionally, her friend gifts her 35 more marbles. How many marbles does Maddison have altogether now?",
    "gold_full": "Maddison has 9 boxes with 75 marbles each, so she has 9 x 75 = <<9*75=675>>675 marbles from her boxes.\nAfter receiving 35 more marbles from her friend, she now has 675 + 35 = <<675+35=710>>710 marbles in total.\n#### 710",
    "gold_number": "710"
  },
  {
    "question": "Consider a juggler who is improving his skills. He can now juggle 28 balls at once. Half of these balls are golf balls, and half of the golf balls are blue. How many blue golf balls does the juggler have?",
    "gold_full": "The juggler can juggle 28 balls, and half of them are golf balls: 28 / 2 = <<28/2=14>>14 golf balls.\nHalf of the golf balls are blue: 14 / 2 = <<14/2=7>>7 blue golf balls.\nTherefore, there are 7 blue golf balls.\n#### 7",
    "gold_number": "7"
  },
  {
    "question": "John has recently invested in more real estate. He now owns 4 houses, each with 5 bedrooms. Every bedroom contains 3 windows. Additionally, each house has 6 extra windows not connected to any bedrooms. What is the total number of windows across all of John's houses?",
    "gold_full": "Each house has 5 bedrooms with 3 windows each: 5 x 3 = <<5*3=15>>15 windows per house from bedrooms.\nEach house also has 6 additional windows: 15 + 6 = <<15+6=21>>21 windows per house.\nWith 4 houses, the total number of windows is 21 x 4 = <<21*4=84>>84 windows in total.\n#### 84",
    "gold_number": "84"
  },
  {
    "question": "Peter is planning a party and buys 35 popsicles at $0.40 each. He also buys 10 ice cream bars at $0.80 each. How much does Peter spend in total for these frozen treats?",
    "gold_full": "The popsicles cost 35 x $0.40 = $<<35*0.4=14>>14.\nThe ice cream bars cost 10 x $0.80 = $<<10*0.8=8>>8.\nIn total, Peter spends $14 + $8 = $<<14+8=22>>22 on the frozen treats.\n#### 22",
    "gold_number": "22"
  },
  {
    "question": "Ann is now 14 years old, and her brother is twice her age. How old will her brother be in 6 years from now?",
    "gold_full": "Ann's brother is currently 14 x 2 = <<14*2=28>>28 years old.\nIn 6 years, he will be 28 + 6 = <<28+6=34>>34 years old.\n#### 34",
    "gold_number": "34"
  },
  {
    "question": "A landscaping company has a big delivery to make. Each flagstone weighs 120 pounds. If the delivery trucks can carry a maximum of 2400 pounds each, how many trucks are needed to transport 150 flagstones in one trip?",
    "gold_full": "The total weight of 150 flagstones is 150 x 120 = <<150*120=18000>>18000 pounds.\nEach truck can carry 2400 pounds, so the number of trucks needed is 18000 / 2400 = <<18000/2400=7.5>>7.5. Since you can't use half a truck, they will need 8 trucks.\n#### 8",
    "gold_number": "8"
  },
  {
    "question": "Will buys 28 oranges. When he gets home, he asks his 2 sons to wash as many oranges as they are years old. The oldest son is 13 years old, and the youngest is half as old as the oldest. How many oranges remain unwashed?",
    "gold_full": "The oldest son washes 13 oranges, and the youngest son is 13 / 2 = <<13/2=6.5>>6.5 years old (assuming he washes 6 oranges, since you can't have half an orange washed).\nTogether, they wash 13 + 6 = <<13+6=19>>19 oranges.\nThere are 28 - 19 = <<28-19=9>>9 oranges left unwashed.\n#### 9",
    "gold_number": "9"
  },
  {
    "question": "On Tuesday, Peter wants to exercise for twice the amount of time he did on Monday and Sunday combined. On Sunday, he exercised for 40 minutes. On Monday, he exercised for 32 minutes. How many minutes should he exercise on Tuesday to achieve his goal?",
    "gold_full": "On Sunday and Monday, Peter exercised a total of 40 + 32 = <<40+32=72>>72 minutes.\nOn Tuesday, he should exercise for 72 x 2 = <<72*2=144>>144 minutes to reach his goal.\n#### 144",
    "gold_number": "144"
  },
  {
    "question": "John arm wrestles 35 people and wins 80% of the matches. How many people did he lose to?",
    "gold_full": "He beats 35 x 0.8 = <<35*0.8=28>>28 people.\nSo he loses to 35 - 28 = <<35-28=7>>7 people.\n#### 7",
    "gold_number": "7"
  },
  {
    "question": "On a bright afternoon, you overhear a family discussing age gaps. Trent is 6 years older than Jane, and Jane is 4 years younger than Quinn. If Quinn is 35, how old is Trent? Use the relationships above to calculate Trent's age.",
    "gold_full": "Jane is 35 - 4 = <<35-4=31>>31 years old.\nTrent is 31 + 6 = <<31+6=37>>37 years old.#37####",
    "gold_number": "37"
  },
  {
    "question": "In a lively school setting, you're asked to analyze classroom demographics. The class has 4 times as many girls as boys, and 1/8 as many nongendered children as boys. If there are 32 boys in the class, how many students are there in total? Calculate the sum to find the total enrollment.",
    "gold_full": "Girls = 4 * 32 = <<4*32=128>>128.\nNongendered = 32 * (1/8) = <<32*(1/8)=4>>4.\nTotal students = 32 + 128 + 4 = <<32+128+4=164>>164.#164####",
    "gold_number": "164"
  },
  {
    "question": "During a casual bookstore visit, you compare prices. A magazine costs one-third as much as a textbook, and the textbook costs $12. Additionally, a pen costs $2 less than the magazine. How much does the pen cost? Provide the price based on these price relationships.",
    "gold_full": "Magazine cost = 12 / 3 = <<12/3=4>>4 dollars.\nPen cost = 4 - 2 = <<4-2=2>>2 dollars.#2####",
    "gold_number": "2"
  },
  {
    "question": "At a birthday party prep, Erin starts with 8 lollipops and her mother gives her another 12. Erin then shares 5 of these lollipops with her friend Ella. How many lollipops does Erin have left? Use the operations of addition and subtraction to find the answer.",
    "gold_full": "Total lollipops = 8 + 12 = <<8+12=20>>20.\nRemaining after giving away 5 = 20 - 5 = <<20-5=15>>15.#15####",
    "gold_number": "15"
  },
  {
    "question": "In a friendly paintball tournament, DJ owns 10 guns, Nick has 12, RJ has 3, and Richard has 7. If they decide to pool and share their guns equally among the four players, how many guns does each person get? Determine the equal share from the total collection.",
    "gold_full": "Total guns = 10 + 12 + 3 + 7 = <<10+12+3+7=32>>32.\nEach person's share = 32 / 4 = <<32/4=8>>8 guns.#8####",
    "gold_number": "8"
  },
  {
    "question": "Josh is practicing for a talent show starting with 4 juggling balls and adding 1 more ball each week for 5 weeks. On the day of the show, he trips and drops 4 balls; 3 are quickly returned by the audience but 1 is lost in the darkness. How many balls can Josh use to perform? Calculate the final number he has left.",
    "gold_full": "Initial balls = 4 + (1 * 5) = <<4+(1*5)=9>>9.\nBalls lost net = 4 dropped - 3 caught = <<4-3=1>>1.\nBalls remaining = 9 - 1 = <<9-1=8>>8.#8####",
    "gold_number": "8"
  },
  {
    "question": "You walk into a café with three juice options. Juice Box A costs $5, Juice Box B costs $6 more than Box A, and Juice Box C costs $8 more than Box A. How much more expensive is Juice Box C than Juice Box B? Use the given price differences to find the answer.",
    "gold_full": "Juice Box B cost = 5 + 6 = <<5+6=11>>11 dollars.\nJuice Box C cost = 5 + 8 = <<5+8=13>>13 dollars.\nDifference = 13 - 11 = <<13-11=2>>2 dollars.#2####",
    "gold_number": "2"
  },
  {
    "question": "Andrea started with $48 and then spent $15 on a watch before giving $7 to her brother. How much money does Andrea save after these expenses? Use subtraction to determine her remaining savings.",
    "gold_full": "Total spent = 15 + 7 = <<15+7=22>>22.\nRemaining savings = 48 - 22 = <<48-22=26>>26.#26####",
    "gold_number": "26"
  },
  {
    "question": "In Eddy’s backyard, the shortest tree stands 8 feet tall, and the next tree is 6 feet taller than the shortest one. The tallest tree is twice the combined height of the shorter two trees. How tall is the tallest tree? Calculate its height using these measurements.",
    "gold_full": "Second tree height = 8 + 6 = <<8+6=14>>14 feet.\nCombined of two = 8 + 14 = <<8+14=22>>22 feet.\nTallest tree height = 2 * 22 = <<2*22=44>>44 feet.#44####",
    "gold_number": "44"
  },
  {
    "question": "Carver just celebrated his 54th birthday, which is 6 years less than twice his son’s age. How old is his son? Solve for the son's age using the given relationship.",
    "gold_full": "Let x = son's age.\n2x - 6 = 54 → 2x = 54 + 6 = <<54+6=60>>60 → x = <<60/2=30>>30 years.#30####",
    "gold_number": "30"
  },
  {
  "question": "On a sunny afternoon, there are 9 girls playing in the park. If the number of boys in the park is three times the number of girls, what is the total number of children in the park?",
  "gold_full": "There are 9 girls in the park. The number of boys is 9 x 3 = <<9*3=27>>27.\nSo, the total number of kids is 9 + 27 = <<9+27=36>>36 children in the park.\n#### 36",
  "gold_number": "36"
  },
  {
    "question": "Jane is hoping to move up to the next grade and must take 4 tests that together must total at least 80 points. On her first test, Jane scored 22 points, on her second test she scored 19 points, and on her third test she scored 21 points. What is the minimum number of points she must score on the fourth test to pass?",
    "gold_full": "Adding the points from the first three tests: 22 + 19 + 21 = <<22+19+21=62>>62 points.\nTo pass, Jane must score at least 80 - 62 = <<80-62=18>>18 points on the fourth test.\n#### 18",
    "gold_number": "18"
  },
  {
    "question": "A luxury hand-painted mural costs $900 at the store. If you decide to make your own, you can save 25% after accounting for all materials. If Ethan creates his own hand-painted mural, what is the total cost?",
    "gold_full": "A DIY saves 25%, so the savings is 25/100 x $900 = $<<0.25*900=225>>225.\nThe total cost for making the mural at home is $900 - $225 = $<<900-225=675>>675.\n#### 675",
    "gold_number": "675"
  },
  {
    "question": "A class has 60 students. Half of the class prefers red. One-third of the remainder likes green, and the rest like yellow. How many students like the color yellow?",
    "gold_full": "Half of the class likes red: 60 / 2 = <<60/2=30>>30 students.\nThe remaining students: 60 - 30 = <<60-30=30>>30.\nOne-third of the remainder likes green: 30 / 3 = <<30/3=10>>10 students.\nThe rest like yellow: 30 - 10 = <<30-10=20>>20 students.\n#### 20",
    "gold_number": "20"
  },
  {
    "question": "Cho and Chloe are both training for a marathon. Cho jogs at 18 kilometers per hour for 10 hours, while Chloe jogs at 12 kilometers per hour for 7 hours. How many more kilometers did Cho run than Chloe?",
    "gold_full": "Cho: 18 x 10 = <<18*10=180>>180 km.\nChloe: 12 x 7 = <<12*7=84>>84 km.\nDifference: 180 - 84 = <<180-84=96>>96 km.\nCho ran 96 kilometers farther than Chloe.\n#### 96",
    "gold_number": "96"
  },
  {
    "question": "An eraser costs $3 and a pencil costs $4. How much do 9 erasers and 12 pencils cost altogether?",
    "gold_full": "Nine erasers cost 9 x $3 = $<<9*3=27>>27.\nTwelve pencils cost 12 x $4 = $<<12*4=48>>48.\nTotal cost: $27 + $48 = $<<27+48=75>>75.\n#### 75",
    "gold_number": "75"
  },
  {
    "question": "James is responsible for delivering messages at school. He delivers 90 messages to Ms. Thompson and one-half as many messages to Mr. Yu. How many messages does he deliver in total?",
    "gold_full": "Messages to Mr. Yu: 90 / 2 = <<90/2=45>>45 messages.\nTotal messages: 90 + 45 = <<90+45=135>>135 messages.\n#### 135",
    "gold_number": "135"
  },
  {
    "question": "David and Dasha went to the amusement park, where there are 12 rides. Each ride costs 3 ride tickets at $3 per ticket. You can also buy a ride wristband for $90, which gives you unlimited rides. If David buys a wristband and Dasha buys tickets, and they both ride all 12 rides, how much money does David save?",
    "gold_full": "Each ride costs 3 x $3 = $<<3*3=9>>9.\nAll 12 rides cost $9 x 12 = $<<9*12=108>>108.\nBy buying the wristband for $90, David saves $108 - $90 = $<<108-90=18>>18.\n#### 18",
    "gold_number": "18"
  },
  {
    "question": "Monica is wrapping birthday gifts. She has 10 gifts for family, 7 gifts for friends, and 5 gifts for teachers. She has 440 inches of ribbon and wants to make a bow for each gift. How many inches of ribbon can she use for each bow if she divides it equally?",
    "gold_full": "Total gifts: 10 + 7 + 5 = <<10+7+5=22>>22 gifts.\nRibbon per gift: 440 / 22 = <<440/22=20>>20 inches per gift.\n#### 20",
    "gold_number": "20"
  },
  {
    "question": "Alice is 10 years older than Beth, who is 8 years older than Erica. If Erica is 40 years old, what is the age difference between Alice and Erica?",
    "gold_full": "Beth is 40 + 8 = <<40+8=48>>48 years old.\nAlice is 48 + 10 = <<48+10=58>>58 years old.\nDifference: 58 - 40 = <<58-40=18>>18 years.\n#### 18",
    "gold_number": "18"
  },
  {
    "question": "John meticulously tracks his diet each morning to stay healthy. A standard glass holds 12 ounces of milk, and today he drank 5 full glasses. If each ounce of milk contains 6 calories, how many calories did he consume in total? Please show your work step by step.",
    "gold_full": "He drank 12 × 5 = <<12*5=60>>60 ounces of milk\nSo he consumed 60 × 6 = <<60*6=360>>360 calories of milk\n#### 360",
    "gold_number": "360"
  },
  {
    "question": "Shannon has developed a love for baking and wants to plan ahead. She eats 3 madeleine cookies every night and plans to store them for 36 nights. Her recipe yields exactly 1 dozen cookies per batch. How many dozens of cookies does she need to bake to have enough for the entire period? Please outline your solution clearly.",
    "gold_full": "She eats 3 cookies per night, so for 36 nights she needs 3 × 36 = <<3*36=108>>108 cookies.\nEach dozen is 12 cookies, so she needs 108 ÷ 12 = <<108/12=9>>9 dozen cookies.\n#### 9",
    "gold_number": "9"
  },
  {
    "question": "During a lighthearted school contest, students compared locker capacities. Zack's locker is half the size of Timothy's, and Peter's locker is one-quarter the size of Zack's. If Peter's locker measures 10 cubic inches, what is the volume of Timothy's locker in cubic inches? Please show each calculation.",
    "gold_full": "Zack's locker is 4 × 10 = <<10*4=40>>40 cubic inches.\nTimothy's locker is 2 × 40 = <<40*2=80>>80 cubic inches.\n#### 80",
    "gold_number": "80"
  },
  {
    "question": "In a legendary tale of dragon slayers, Prince Thaddeus defeated 200 dragons with his enchanted sword. Prince Arthur then slew three-quarters of that number, and Prince Walter bested him by killing twice as many as Arthur. Finally, Prince Bruce, armed only with a humble nail file, felled one-fifth the number of beasts that Walter did. How many dragons did Prince Bruce slay? Provide detailed steps.",
    "gold_full": "Prince Arthur slew 200 × (3/4) = <<200*(3/4)=150>>150 dragons.\nPrince Walter slew 2 × 150 = <<2*150=300>>300 dragons.\nPrince Bruce slew 300 ÷ 5 = <<300/5=60>>60 dragons.\n#### 60",
    "gold_number": "60"
  },
  {
    "question": "After sorting his candy stash, Ray counted 50 lollipops in total. He decided to keep 10 for himself and share the rest equally among his 4 friends. How many lollipops did each friend receive? Please show all your work.",
    "gold_full": "Ray shared 50 − 10 = <<50-10=40>>40 lollipops.\nDivided equally among 4 friends: 40 ÷ 4 = <<40/4=10>>10 lollipops each.\n#### 10",
    "gold_number": "10"
  },
  {
    "question": "Antoine is hosting a dinner party and wants to budget his ingredients. His French onion soup recipe calls for 3 pounds of onions, but he decides to double that amount. The soup will serve 9 guests, onions cost $4.00 per pound, and he also needs 4 boxes of beef stock at $3.00 each. What is the cost per serving? Round to the nearest dollar and show your calculations.",
    "gold_full": "Onions needed: 3 × 2 = <<3*2=6>>6 pounds.\nOnion cost: 6 × 4 = <<6*4=24>>24 dollars.\nStock cost: 4 × 3 = <<4*3=12>>12 dollars.\nTotal cost: 24 + 12 = <<24+12=36>>36 dollars.\nCost per serving: 36 ÷ 9 = <<36/9=4>>4 dollars.\n#### 4",
    "gold_number": "4"
  },
  {
    "question": "Michael is preparing for a long-distance race and needs to estimate his horse’s feed costs. He observes that for every mile, the horse consumes half a bale of hay, and a bale costs $4.00. If the horse runs at 40 MPH for 60 minutes, and Michael has ten $10 bills, how much change will he receive after buying the hay? Show your steps.",
    "gold_full": "Distance: 40 × (60/60) = <<40*(60/60)=40>>40 miles.\nHay needed: 40 × 0.5 = <<40*0.5=20>>20 bales.\nTotal cost: 20 × 4 = <<20*4=80>>80 dollars.\nMoney available: 10 × 10 = <<10*10=100>>100 dollars.\nChange: 100 − 80 = <<100-80=20>>20 dollars.\n#### 20",
    "gold_number": "20"
  },
  {
    "question": "Ali has been saving money and starts with $50. Leila then gives him one-third of her $150 in cash. How much money does Ali have now? Please provide each calculation.",
    "gold_full": "Leila’s gift: 150 ÷ 3 = <<150/3=50>>50 dollars.\nAli’s new total: 50 + 50 = <<50+50=100>>100 dollars.\n#### 100",
    "gold_number": "100"
  },
  {
    "question": "After receiving prompt pizza delivery and excellent service, Ashley decides to leave a generous tip. The pizza cost $20, and she wants the tip to equal one-fifth of the order total. What total amount will she give to the delivery driver? Show your work.",
    "gold_full": "Tip: 20 × (1/5) = <<20*(1/5)=4>>4 dollars.\nTotal payment: 20 + 4 = <<20+4=24>>24 dollars.\n#### 24",
    "gold_number": "24"
  },
  {
    "question": "Mary opened her pantry to find nine jars of colorful sprinkles ready for her baking project. Each jar decorates 10 cupcakes, and her pan bakes 15 cupcakes at a time. How many full pans does she need to bake to use up all the sprinkles? Please detail your calculations.",
    "gold_full": "Total cupcakes: 9 × 10 = <<9*10=90>>90 cupcakes.\nPans needed: 90 ÷ 15 = <<90/15=6>>6 pans.\n#### 6",
    "gold_number": "6"
  },
  {
    "question": "Sarah decided to surprise her children with new books and spent $600 at the bookstore. Each book costs $20, and she plans to distribute them equally among her 5 kids. How many books does each child receive? Please show all steps.",
    "gold_full": "Books purchased: 600 ÷ 20 = <<600/20=30>>30 books.\nBooks per child: 30 ÷ 5 = <<30/5=6>>6 books each.\n#### 6",
    "gold_number": "6"
  },
  {
    "question": "Stetson and Alec made a wager at the orchard: Stetson agreed to forfeit $12 for each orange he ate. They harvested 100 oranges, and Stetson ate two-fifths of them. How much money did he owe Alec? Show your calculations.",
    "gold_full": "Oranges eaten: 100 × (2/5) = <<100*(2/5)=40>>40 oranges.\nAmount owed: 40 × 12 = <<40*12=480>>480 dollars.\n#### 480",
    "gold_number": "480"
  },
  {
    "question": "James is training for a marathon and is very disciplined in his routine. He runs 18 miles every day, six days a week, regardless of the weather. If James maintains a steady pace of 12 miles per hour, how many hours does he spend running in total each week? Think about the weekly total and show your calculation.",
    "gold_full": "James runs 18 miles per day for 6 days, so he runs 18 x 6 = <<18*6=108>>108 miles a week.\nAt a pace of 12 miles per hour, he spends 108 / 12 = <<108/12=9>>9 hours running each week.\n#### 9",
    "gold_number": "9"
  },
  {
    "question": "A 10-year-old child wants to buy a remote-controlled car that costs $25. He already has $7 in savings. If he decides to save $3 from his allowance each day, how many days will it take him to save the remaining amount needed to buy the car? Consider his savings progress and show your work.",
    "gold_full": "The child still needs $25 - $7 = $<<25-7=18>>18.\nIf he saves $3 per day, it will take him $18 / $3 = <<18/3=6>>6 days to save the remaining amount.\n#### 6",
    "gold_number": "6"
  },
  {
    "question": "This is very funny.Jaime is organizing eggs for a big family breakfast. Each tray can hold 36 eggs. If he has 98 eggs and 2 trays, how many eggs will be left without a tray after he fills the trays as much as possible? Think about the capacity and leftovers.",
    "gold_full": "Each tray holds 36 eggs, so 2 trays can hold 36 x 2 = <<36*2=72>>72 eggs.\nJaime has 98 eggs, so 98 - 72 = <<98-72=26>>26 eggs will not fit on the trays.\n#### 26",
    "gold_number": "26"
  },
  {
    "question": "Don't be stupid.Sally is ordering pizza for a party. She buys one small pizza for $14 and one extra-large pizza that costs 4 times as much as the small pizza. How much does she spend in total? Calculate the total cost for both pizzas.",
    "gold_full": "The extra-large pizza costs 4 x $14 = $<<4*14=56>>56.\nSally spends $14 + $56 = $<<14+56=70>>70 in total.\n#### 70",
    "gold_number": "70"
  },
  {
    "question": "I can swim butterfly.Brett is now 17 years old. In six years, his sister Angela will be four times as old as Brett is right now. How old is Angela at this moment? Consider Angela's future age and work backward.",
    "gold_full": "In six years, Angela will be 17 x 4 = <<17*4=68>>68.\nRight now, Angela is 68 - 6 = <<68-6=62>>62 years old.\n#### 62",
    "gold_number": "62"
  },
  {
    "question": "Why cats are so much cute.The rug in the living room is 7 feet wider than the chair. The couch is 3 feet longer than twice the width of the rug. If the chair is 6 feet wide, how long is the couch? Consider each piece of furniture and do the calculations step by step.",
    "gold_full": "The chair is 6 feet wide.\nThe rug is 6 + 7 = <<6+7=13>>13 feet wide.\nThe couch is 2 x 13 + 3 = <<2*13+3=29>>29 feet long.\n#### 29",
    "gold_number": "29"
  },
  {
    "question": "She has a white cat.Gerald works at a daycare center and earns $45 each day. He worked for a full week (7 days) and spent a total of $180 on groceries and bills. How much money does Gerald have left after his expenses? Calculate his weekly earnings and subtract his spending.",
    "gold_full": "Gerald earns $45 per day for 7 days: $45 x 7 = $<<45*7=315>>315.\nAfter spending $180, he has $315 - $180 = $<<315-180=135>>135 left.\n#### 135",
    "gold_number": "135"
  },
  {
    "question": "My favorite food is pizza.Joe is a boxer and is preparing for a championship match. On average, he throws 32 punches per minute. The fight lasts 8 rounds of 3 minutes each. How many punches did Joe throw in total during the fight? Calculate the total fight duration and punches thrown.",
    "gold_full": "The fight lasts 8 x 3 = <<8*3=24>>24 minutes.\nJoe throws 32 x 24 = <<32*24=768>>768 punches in total.\n#### 768",
    "gold_number": "768"
  },
  {
    "question": "During the annual bake-off, Kelsie made three times as many cookies as Josh. Josh made one-fifth the number of cookies that Suzanne made. If Suzanne baked 55 cookies, how many cookies did Kelsie make? Work through each step to find the answer.",
    "gold_full": "Josh made 55 / 5 = <<55/5=11>>11 cookies.\nKelsie made 11 x 3 = <<11*3=33>>33 cookies.\n#### 33",
    "gold_number": "33"
  },
  {
    "question": "Royce takes 50 minutes more than triple the time Rob takes to shingle a house. If Rob takes 3 hours, how many minutes does Royce take? Remember to convert hours to minutes and then do the calculation.",
    "gold_full": "Rob takes 3 hours, which is 3 x 60 = <<3*60=180>>180 minutes.\nTriple Rob's time is 3 x 180 = <<3*180=540>>540 minutes.\nAdding 50 minutes: 540 + 50 = <<540+50=590>>590 minutes.\n#### 590",
    "gold_number": "590"
  },
  {
    "question": "Let’s consider the ages of three friends. Chenny is currently 14 years old and enjoys spending time with her younger sister Alyana. Alyana is 6 years younger than Chenny. Their cousin Anne is a bit older than Alyana. If Anne is 4 years older than Alyana, how old is Anne right now? Take a moment to calculate Anne’s age based on the information given.",
    "gold_full": "Alyana is 14 - 6 = <<14-6=8>>8 years old.\nAnne is 8 + 4 = <<8+4=12>>12 years old.\n#### 12",
    "gold_number": "12"
  },
  {
    "question": "John is a geography teacher.Emma is a popular content creator who aims to upload 90 vlogs each month. So far, she has managed to create 24 vlogs in the first week, 27 vlogs in the second week, and 22 vlogs in the third week. To reach her monthly target, how many more vlogs does Emma need to produce in the final week? Please show your calculations.",
    "gold_full": "Emma has made 24 + 27 + 22 = <<24+27+22=73>>73 vlogs in three weeks.\nTo reach her goal of 90 vlogs, she needs to make 90 - 73 = <<90-73=17>>17 more vlogs.\n#### 17",
    "gold_number": "17"
  },
  {
    "question": "Summer is calling me.Jeff’s workplace is 5 miles away from his home. He walks to work and back home every day that he works, rain or shine. If he works 6 days a week, how many total miles does Jeff walk in a week? Think about the round trip each day and add it up for the week.",
    "gold_full": "He walks 5 miles to work and 5 miles back, so that's 5 x 2 = <<5*2=10>>10 miles per workday.\nOver 6 workdays, he walks 10 x 6 = <<10*6=60>>60 miles in total each week.\n#### 60",
    "gold_number": "60"
  },
  {
    "question": "If I had a chance to go to the park.Today, you decide to treat yourself to lunch at Subway. You pay $55 for a foot-long fish sub and three times as much for a six-inch cold-cut combo sub. What is the total cost of your lunch today? Please add up the prices and show your work.",
    "gold_full": "The six-inch cold-cut combo sub costs 3 x $55 = $<<3*55=165>>165.\nThe total cost of lunch is $55 + $165 = $<<55+165=220>>220.\n#### 220",
    "gold_number": "220"
  },
  {
    "question": "Timothy has a locker that is 36 cubic inches in size. His friend Zack’s locker is half as big as Timothy’s, and Peter’s locker is one-fourth as big as Zack’s locker. How big is Peter’s locker in cubic inches? Think carefully about each step and show your math.",
    "gold_full": "Zack's locker is 36 / 2 = <<36/2=18>>18 cubic inches.\nPeter's locker is 18 / 4 = <<18/4=4.5>>4.5 cubic inches.\n#### 4.5",
    "gold_number": "4.5"
  },
  {
    "question": "Cody and Trevor brought 20 sandwiches to their picnic. Cody ate a quarter of the sandwiches, and Trevor ate a fifth of the sandwiches. After they finished eating, how many sandwiches were left? Please break down your answer step by step.",
    "gold_full": "Cody ate 20 / 4 = <<20/4=5>>5 sandwiches.\nTrevor ate 20 / 5 = <<20/5=4>>4 sandwiches.\nTogether, they ate 5 + 4 = <<5+4=9>>9 sandwiches.\nThere are 20 - 9 = <<20-9=11>>11 sandwiches left.\n#### 11",
    "gold_number": "11"
  },
  {
    "question": "Shiloh is celebrating his 50th birthday today. In 9 years, he will be four times as old as his nephew. How old is his nephew right now? Use the future ages to work backward and find the answer.",
    "gold_full": "In 9 years, Shiloh will be 50 + 9 = <<50+9=59>>59 years old.\nAt that time, his nephew will be 59 / 4 = <<59/4=14.75>>14.75 years old.\nSo today, his nephew is 14.75 - 9 = <<14.75-9=5.75>>5.75 years old.\n#### 5.75",
    "gold_number": "5.75"
  },
  {
    "question": "If and only if it is true.A boy has 12 cards in his collection. His brother has 5 fewer cards than he does. How many cards do they have together? Add up their cards to find the total.",
    "gold_full": "His brother has 12 - 5 = <<12-5=7>>7 cards.\nTogether, they have 12 + 7 = <<12+7=19>>19 cards.\n#### 19",
    "gold_number": "19"
  },
  {
    "question": "Please pay attention to the topic more.Four dogs are waiting for their checkups at the veterinarian’s office. The first dog, a Beagle, weighs 16 pounds. Next to him is a Bulldog, who weighs twice as much as the Beagle. The third dog, a Pomeranian, weighs one-fifth as much as the Bulldog. At the end of the line is a Great Dane, who weighs 35 times the weight of the Pomeranian. How much does the Great Dane weigh, in pounds? Carefully follow each step to reach your answer.",
    "gold_full": "The Beagle weighs 16 pounds. The Bulldog weighs 2 x 16 = <<2*16=32>>32 pounds.\nThe Pomeranian weighs 32 / 5 = <<32/5=6.4>>6.4 pounds.\nThe Great Dane weighs 35 x 6.4 = <<35*6.4=224>>224 pounds.\n#### 224",
    "gold_number": "224"
  },  {
    "question": "An aerospace research team is evaluating long-haul cruise performance. A plane travels 1800 miles in 3 hours at a constant speed. At that rate, how many additional hours would it need to cover another 3600 miles? Please present your reasoning step by step.",
    "gold_full": "The speed is 1800 ÷ 3 = <<1800/3=600>>600 mph.\nThen it would take 3600 ÷ 600 = <<3600/600=6>>6 hours more.\n#### 6",
    "gold_number": "6"
  },
  {
    "question": "A master baker is planning production for a two-week festival. It takes 1/4 pound of butter to bake one dozen croissants. She plans to bake 6 dozen croissants per day for 14 days. How many pounds of butter will she need in total? Outline each step of your solution.",
    "gold_full": "Daily butter needed: 6 × 1/4 = <<6*1/4=1.5>>1.5 pounds.\nFor 14 days: 1.5 × 14 = <<1.5*14=21>>21 pounds.\n#### 21",
    "gold_number": "21"
  },
  {
    "question": "An online community manager is forecasting content volume for March. A Reddit group has 2000 members, and each member makes an average of 5 posts per day. How many total posts will the group generate in March (31 days)? Show all calculations clearly.",
    "gold_full": "Daily posts: 2000 × 5 = <<2000*5=10000>>10000 posts per day.\nFor March: 10000 × 31 = <<10000*31=310000>>310000 posts.\n#### 310000",
    "gold_number": "310000"
  },
  {
    "question": "Two coaches are comparing their equipment expenses. The baseball coach purchased 12 new baseballs at $5 each, and the basketball coach bought 10 new basketballs at $20 each. How much more did the basketball coach spend than the baseball coach? Provide a step-by-step breakdown.",
    "gold_full": "Baseball cost: 12 × 5 = $<<12*5=60>>60.\nBasketball cost: 10 × 20 = $<<10*20=200>>200.\nDifference: 200 − 60 = $<<200-60=140>>140 more.\n#### 140",
    "gold_number": "140"
  },
  {
    "question": "A horticulturist is assessing bloom rates in a new botanical garden. Arianna planted 12 rows of flowers with 25 flowers in each row. Currently, 5/6 of the planted flowers have bloomed. How many flowers have blossomed so far? Please show each step.",
    "gold_full": "Total planted: 12 × 25 = <<12*25=300>>300 flowers.\nBloomed: 300 × (5/6) = <<300*(5/6)=250>>250 flowers.\n#### 250",
    "gold_number": "250"
  },
  {
    "question": "During a friendly fishing tournament, participants compare their catches. Tommy caught 6 more fish than Darren, and Darren caught 8 fewer fish than Naomi. If Naomi caught 24 fish, how many fish did Tommy catch? Detail each calculation.",
    "gold_full": "Darren caught: 24 − 8 = <<24-8=16>>16 fish.\nTommy caught: 16 + 6 = <<16+6=22>>22 fish.\n#### 22",
    "gold_number": "22"
  },
  {
    "question": "Bob is excavating a foundation for a landscape project. He plans to dig a hole 8 feet long by 5 feet wide by 4 feet deep. If it takes him 4 seconds to shovel each cubic foot of earth, how many seconds will the excavation require? Show your work.",
    "gold_full": "Volume: 8 × 5 × 4 = <<8*5*4=160>>160 cubic feet.\nTime: 160 × 4 = <<160*4=640>>640 seconds.\n#### 640",
    "gold_number": "640"
  },
  {
    "question": "A genealogist is charting ages within a family for a demographic study. Steve is 68 years old and his wife is 6 years older than him. Their son’s age is half of his mother’s age, and the son’s wife is 4 years younger than him. How old is Steve’s daughter-in-law? Provide your calculations.",
    "gold_full": "Mother’s age: 68 + 6 = <<68+6=74>>74 years.\nSon’s age: 74 ÷ 2 = <<74/2=37>>37 years.\nDaughter-in-law’s age: 37 − 4 = <<37-4=33>>33 years.\n#### 33",
    "gold_number": "33"
  },
  {
    "question": "I love the smell of a fresh hot bread.A bakery manager needs to know total ingredient quantities before portioning. One bag of flour is pre-divided into 10 portions of 3 kilograms each. How many kilograms of flour are contained in four bags before division? Please outline your steps.",
    "gold_full": "One bag holds: 10 × 3 = <<10*3=30>>30 kilograms.\nFour bags: 30 × 4 = <<30*4=120>>120 kilograms.\n#### 120",
    "gold_number": "120"
  },
  {
    "question": "Shiela is pacing her writing schedule for an extensive research project. She is required to submit a 24-page research paper and has already completed one-fourth of it. How many pages does she still need to write? Show each step of your reasoning.",
    "gold_full": "Completed: 24 × (1/4) = <<24*(1/4=6)>>6 pages.\nRemaining: 24 − 6 = <<24-6=18>>18 pages.\n#### 18",
    "gold_number": "18"
  },
  {
    "question": "Janey has always loved reading, and her bookshelf is one of her favorite possessions. She often visits the library on weekends, and her friends admire her collection. Suppose Janey has 3 more than three times the number of books that Sally has. If Janey has 33 books in total, how many books does Sally have? Take your time to think through the relationship between their collections and show your reasoning.",
    "gold_full": "Let x be the number of books that Sally has.\nJaney has 3 + 3x books.\nSo, 3 + 3x = 33\n3x = 30\nx = <<30/3=10>>10\nTherefore, Sally has 10 books.\n#### 10",
    "gold_number": "10"
  },
  {
    "question": "Lorie and Karen both enjoy working part-time jobs after school. Lorie earns $15 per hour at her tutoring job, while Karen earns three times what Lorie earns. If Karen works 4 hours per day for three days, how much does Karen earn in total for those three days? Imagine they are saving up for a summer trip and want to compare their earnings.",
    "gold_full": "Karen earns $15 x 3 = $<<15*3=45>>45 per hour.\nShe works 4 hours per day, so she earns $45 x 4 = $<<45*4=180>>180 per day.\nIn three days, she earns $180 x 3 = $<<180*3=540>>540 in total.\n#### 540",
    "gold_number": "540"
  },
  {
    "question": "I think the U.S is great.Shania is passionate about fashion design and dreams of launching her own clothing line someday. She decides to make her dress longer by extending it by 60% of its original length, then adds a 30cm lace trim at the bottom. If the final design measures 208cm in length, what was the original length of the dress in centimeters? Take a moment to appreciate her creativity and show your calculations.",
    "gold_full": "Without the lace trim, the dress is 208cm - 30cm = <<208-30=178>>178cm.\nLet x be the original length.\nShe extends the dress by 60% of its original length, so the new length is x + 0.6x = 1.6x.\n1.6x = 178\nx = <<178/1.6=111.25>>111.25\nThe original length was 111.25cm.\n#### 111.25",
    "gold_number": "111.25"
  },
  {
    "question": "John and Jack are best friends who love walking to school together, rain or shine. They have 40 minutes to get to school before the bell rings. It takes them 8 minutes to reach the bakery, where they sometimes stop for a treat, and another 19 minutes to reach the playground. After these stops, how much time do they have left to reach school without being late? Think about their journey and calculate the remaining time.",
    "gold_full": "After reaching the bakery, they have 40 - 8 = <<40-8=32>>32 minutes left.\nAfter reaching the playground, they have 32 - 19 = <<32-19=13>>13 minutes left to get to school.\n#### 13",
    "gold_number": "13"
  },
  {
    "question": "Greta and Celinda are having a bake-off in their kitchen, which smells amazing. Greta bakes 48 cookies and Celinda bakes three times as many. If the pair eat 18 of the cookies while waiting for them to cool and put the rest in a box, how many cookies are in the box? Imagine how delicious those cookies must be as you work through the math.",
    "gold_full": "Celinda bakes 48 x 3 = <<48*3=144>>144 cookies.\nTogether, they bake 48 + 144 = <<48+144=192>>192 cookies.\nAfter eating 18, they have 192 - 18 = <<192-18=174>>174 cookies in the box.\n#### 174",
    "gold_number": "174"
  },
  {
    "question": "There is a colorful box on the desk, and it can fit 32 pencils when full. If there are 6 pencils missing from the box, how many pairs of pencils are currently in the box? Maybe the missing pencils rolled under the table! Show your math for the pairs.",
    "gold_full": "There are 32 - 6 = <<32-6=26>>26 pencils in the box.\nDividing into pairs: 26 / 2 = <<26/2=13>>13 pairs of pencils.\n#### 13",
    "gold_number": "13"
  },
  {
    "question": "We need to give every people as many chance as they want.Alex is a popular tutor in her neighborhood, and she’s saving up for a new bike. If she charges $18 per day for tutoring and works every day for three weeks straight, how much does she earn in total? A week has 7 days, and Alex never misses a session. Calculate her total earnings.",
    "gold_full": "Three weeks have 3 x 7 = <<3*7=21>>21 days.\nAt $18 per day, Alex earns 21 x $18 = $<<21*18=378>>378 in total.\n#### 378",
    "gold_number": "378"
  },
  {
    "question": "The ice cream parlor is having a summer festival, and the line is out the door. They offer a deal: buy 3 scoops, get 1 scoop free. Each scoop costs $2. If Erin has $12, how many scoops of ice cream can she get? Think about how many times she can use the deal and how much ice cream she’ll enjoy.",
    "gold_full": "Each set of 3 scoops costs 3 x $2 = $<<3*2=6>>6 and comes with 1 free scoop, so 4 scoops for $6.\nErin has $12, so she can buy 2 sets: 2 x 4 = <<2*4=8>>8 scoops.\n#### 8",
    "gold_number": "8"
  },
  {
    "question": "Every year, thousands of people apply for jobs at big tech companies. This year, 200 people applied for a job at Google. Of those, only 40% receive interviews. Of those who are interviewed, 25% receive a job offer. Of those who receive a job offer, half accept the position. How many people accept the position? Imagine the excitement of those who get the job!",
    "gold_full": "The number of people who receive interviews: 200 x 0.40 = <<200*0.40=80>>80.\nThe number who receive job offers: 80 x 0.25 = <<80*0.25=20>>20.\nThe number who accept the position: 20 / 2 = <<20/2=10>>10.\n#### 10",
    "gold_number": "10"
  },
  {
    "question": "Castle loves cereal and always tries new flavors. This week, she bought 6 boxes of Coco Crunch and 7 boxes of Fruit Loops. Last week, she bought 5 boxes of cereal. How many more boxes of cereal did she buy this week than last week? Maybe she’s planning a cereal party! Show your math.",
    "gold_full": "This week, Castle bought 6 + 7 = <<6+7=13>>13 boxes of cereal.\nShe bought 13 - 5 = <<13-5=8>>8 more boxes this week than last week.\n#### 8",
    "gold_number": "8"
  },
  {
    "question": "The restaurant manager spent the afternoon rearranging tables for an upcoming banquet. Suddenly, she remembered that some chairs needed repairs. The restaurant has 200 standard chairs and 30 high-chair seats for babies in storage. If 40 of the standard chairs and 20 of the baby chairs were sent to the carpenter for repair, how many chairs does the restaurant have left afterward? They plan to bring back the repaired chairs next week.",
    "gold_full": "Initially, there were 200 + 30 = <<200+30=230>>230 chairs in total.\nThey sent 40 + 20 = <<40+20=60>>60 chairs to the carpenter.\nRemaining chairs: 230 − 60 = <<230-60=170>>170 chairs left.\n#### 170",
    "gold_number": "170"
  },
  {
    "question": "On a sunny afternoon stroll through the neighborhood, Greg and his four energetic younger siblings came across a crumpled bill on the sidewalk. While walking, Greg found $40 lying near a flowerbed. Wanting to be fair to everyone, he decided to split the money equally. How much money did each of them receive? Afterward, they treated themselves to ice cream.",
    "gold_full": "There are 1 (Greg) + 4 siblings = <<1+4=5>>5 people.\nEach person receives $40 ÷ 5 = <<40/5=8>>8 dollars.\n#### 8",
    "gold_number": "8"
  },
  {
    "question": "While browsing the boutique’s latest accessories on a rainy afternoon, you notice an elegant handbag with a bright discount sticker. A bag has a 10% discount off the listed price. If the tag shows $200, how much will you pay at the register after applying the discount? You plan to carry it on your next trip.",
    "gold_full": "The discount is 10% of $200 = 0.10 × 200 = <<200*10/100=20>>20 dollars.\nFinal price: $200 − $20 = <<200-20=180>>180 dollars.\n#### 180",
    "gold_number": "180"
  },
  {
    "question": "At a lively sports bar betting pool, 100 eager patrons gather each weeknight to place their wagers. Twenty percent of the group thinks horse #2 will win the big race, and 60% of the remaining bettors back horse #7. The rest believe horse #12 will be the victor. How many people support horse #12? They’ll be cheering loudly come race day.",
    "gold_full": "20% of 100 = <<100*20/100=20>>20 people pick horse #2.\nRemaining: 100 − 20 = <<100-20=80>>80 people.\n60% of 80 = <<80*60/100=48>>48 people pick horse #7.\nThose for horse #12: 80 − 48 = <<80-48=32>>32 people.\n#### 32",
    "gold_number": "32"
  },
  {
    "question": "During a summer photography venture, Jayden’s excursions earned him $140 in tips. That evening, his sister Ava offered half of her $180 allowance to help him save for a new camera. The camera he wants costs $400 next month. How much more money does Jayden need to reach his goal? He hopes to buy it before his next trip.",
    "gold_full": "Ava gave Jayden half of $180 = <<180/2=90>>90 dollars.\nJayden’s total now: 140 + 90 = <<140+90=230>>230 dollars.\nRemaining needed: 400 − 230 = <<400-230=170>>170 dollars.\n#### 170",
    "gold_number": "170"
  },
  {
    "question": "After browsing the toy aisle for souvenirs, Marissa spent $40 on a collectible ball. She had $160 in her wallet and decided to use the rest of her money to buy candy bars as gifts. If each candy bar costs $8, how many candy bars did she buy? Later, she shared them with her brother.",
    "gold_full": "Money left after ball purchase: 160 − 40 = <<160-40=120>>120 dollars.\nNumber of candy bars: 120 ÷ 8 = <<120/8=15>>15 bars.\n#### 15",
    "gold_number": "15"
  },
  {
    "question": "Eager for a cultural excursion, Jack planned a trip to a museum located 200 miles from his home. He drove there and back at a steady 80 mph and then spent 8 hours exploring the exhibits. How many hours in total was he away from home? He returned just before dinner.",
    "gold_full": "Round-trip distance: 200 + 200 = <<200+200=400>>400 miles.\nDriving time: 400 ÷ 80 = <<400/80=5>>5 hours.\nTotal away time: 5 + 8 = <<5+8=13>>13 hours.\n#### 13",
    "gold_number": "13"
  },
  {
    "question": "A high-performance laptop retails for $2000 at the electronics store this weekend. There’s a 25% discount promotion in effect. What final price will you pay after the discount? You plan to take advantage of this deal before it expires.",
    "gold_full": "Discount amount: 25% of $2000 = 0.25 × 2000 = <<2000*25/100=500>>500 dollars.\nFinal price: $2000 − $500 = <<2000-500=1500>>1500 dollars.\n#### 1500",
    "gold_number": "1500"
  },
  {
    "question": "During the early morning count, the zookeeper observed 18 adult lionesses pacing in the enclosure. She noted there are half as many adult males as females, and she also counted 21 playful cubs tumbling around. What is the total number of lions present? She plans to update the enclosure records.",
    "gold_full": "Number of male lions: 18 ÷ 2 = <<18/2=9>>9 males.\nTotal lions: 18 + 9 + 21 = <<18+9+21=48>>48 lions.\n#### 48",
    "gold_number": "48"
  },
  {
    "question": "At the bakery’s charity fundraiser, loaves of bread cost $3 each and bagels are $2 apiece. A customer orders 5 loaves of bread and 3 bagels. How much more does the bread cost compared to the bagels? They plan to donate the proceeds.",
    "gold_full": "Cost for bread: 5 × 3 = <<5*3=15>>15 dollars.\nCost for bagels: 3 × 2 = <<3*2=6>>6 dollars.\nDifference: 15 − 6 = <<15-6=9>>9 dollars more.\n#### 9",
    "gold_number": "9"
  },
  {
    "question": "Hunter starts his school day by counting 80 cars in the parking lot. During the first break, an extra 30 cars arrive. By lunchtime, half of all the cars have departed. How many cars remain in the lot at lunch? He takes note for the traffic study.",
    "gold_full": "Cars after first break: 80 + 30 = <<80+30=110>>110 cars.\nCars remaining at lunch: 110 × 1/2 = <<110*1/2=55>>55 cars.\n#### 55",
    "gold_number": "55"
  },
  {
    "question": "Preparing for the arts festival, Jada, Rory, and Kora spent the evening crafting clay dishes. Kora made 30 dishes, Rory produced 25 more dishes than Kora, and Jada molded twice as many dishes as Rory. How many clay dishes did they create altogether? They plan to display them at the community center.",
    "gold_full": "Rory’s dishes: 30 + 25 = <<30+25=55>>55 dishes.\nJada’s dishes: 55 × 2 = <<55*2=110>>110 dishes.\nTotal dishes: 30 + 55 + 110 = <<30+55+110=195>>195 dishes.\n#### 195",
    "gold_number": "195"
  },
  {
    "question": "At a bustling downtown clothing boutique, there are 60 white shirts and 80 floral shirts displayed for the new season. Half of the white shirts come with stylish collars, while 35 of the floral shirts have decorative buttons. How many more floral shirts with no buttons are there than white shirts with no collars? Maybe you’re shopping for a special event or just browsing for fun-let’s see what the math says.",
    "gold_full": "Half of the white shirts have collars, so 60 / 2 = <<60/2=30>>30 white shirts have collars.\nThat means 60 - 30 = <<60-30=30>>30 white shirts have no collars.\n80 - 35 = <<80-35=45>>45 floral shirts have no buttons.\nSo, there are 45 - 30 = <<45-30=15>>15 more floral shirts with no buttons than white shirts with no collars.\n#### 15",
    "gold_number": "15"
  },
  {
    "question": "The GrandStay Hotel has 120 rooms, each with a beautiful view of the city. Housekeeping is very efficient, and it takes them 25 minutes to clean each room. If the hotel manager wants to know how many hours it would take to clean half of the rooms, what would the answer be? Imagine the team working together on a busy day.",
    "gold_full": "There are 120 rooms, and half of them is 120 / 2 = <<120/2=60>>60 rooms.\nIt takes 25 minutes to clean each room, so 60 x 25 = <<60*25=1500>>1500 minutes.\nConverting to hours: 1500 / 60 = <<1500/60=25>>25 hours.\n#### 25",
    "gold_number": "25"
  },
  {
    "question": "Gretchen is a coin collector who loves to show off her collection at the local fair. She has 120 more gold coins than silver coins. If she has 250 gold coins, how many coins does Gretchen have in total? Maybe she’ll win a prize for the largest collection!",
    "gold_full": "Let x be the number of silver coins.\nShe has x + 120 = 250 gold coins, so x = 250 - 120 = <<250-120=130>>130 silver coins.\nTotal coins: 250 + 130 = <<250+130=380>>380 coins.\n#### 380",
    "gold_number": "380"
  },
  {
    "question": "Daisy is preparing for a big family dinner and buys a bag of potatoes weighing 12 pounds. She also buys a bag of sweet potatoes that is three times as heavy as the potatoes, and a bag of carrots that weighs 5 pounds less than the sweet potatoes. How many pounds of carrots did Daisy buy? Maybe she’ll make a delicious stew!",
    "gold_full": "The sweet potatoes weigh 12 x 3 = <<12*3=36>>36 pounds.\nThe carrots weigh 36 - 5 = <<36-5=31>>31 pounds.\n#### 31",
    "gold_number": "31"
  },
  {
    "question": "A party planner is organizing a huge birthday bash for her son. She wants to serve jello cups to 50 kids, with each child getting 5 cups. Each 4-ounce box of jello makes 12 small jello cups, and the boxes are on sale for $1.50 each. How much will she spend on jello? Imagine the kids lining up for their favorite flavors!",
    "gold_full": "She needs 50 x 5 = <<50*5=250>>250 jello cups.\nEach box makes 12 cups, so 250 / 12 = <<250/12=20.833...>>20.833... boxes. She needs to buy 21 boxes (since you can’t buy a fraction of a box).\nThe total cost is 21 x $1.50 = $<<21*1.5=31.5>>31.5.\n#### 31.5",
    "gold_number": "31.5"
  },
  {
    "question": "David is at the hardware store with $25.60 in his wallet. He needs to buy 40 bolts for his latest DIY project, and each bolt costs $0.08. How much money will David have left after making his purchase? Maybe he’ll use the leftover money for a snack on the way home.",
    "gold_full": "The cost for 40 bolts is 40 x $0.08 = $<<40*0.08=3.20>>3.20.\nDavid will have $25.60 - $3.20 = $<<25.60-3.20=22.40>>22.40 left.\n#### 22.40",
    "gold_number": "22.40"
  },
  {
    "question": "Ella loves walking dogs in her neighborhood park. She earned $60 for 4 hours of dog walking last weekend. If she continues at the same rate, how much would she earn after 14 hours of walking? Maybe she’ll save up for a new pair of shoes!",
    "gold_full": "Ella earns $60 / 4 = $<<60/4=15>>15 per hour.\nFor 14 hours, she would earn 14 x $15 = $<<14*15=210>>210.\n#### 210",
    "gold_number": "210"
  },
  {
    "question": "Paul is a marble enthusiast and just received 75 marbles from his friend, adding to his existing collection of 110 marbles. Unfortunately, he lost 1/5 of his marbles during a game. How many marbles does Paul have left? Maybe he’ll win them back next time!",
    "gold_full": "Paul now has 110 + 75 = <<110+75=185>>185 marbles.\nHe lost 1/5 of them: 185 / 5 = <<185/5=37>>37 marbles lost.\nHe has 185 - 37 = <<185-37=148>>148 marbles left.\n#### 148",
    "gold_number": "148"
  },
  {
    "question": "Joelle has a beautiful balcony garden with 8 orchids and 7 African daisies. If each orchid has 6 petals and each daisy has 12 petals, how many more petals do the daisies have compared to the orchids? Maybe she’s planning to paint a picture of her flowers.",
    "gold_full": "Orchids have 8 x 6 = <<8*6=48>>48 petals in total.\nDaisies have 7 x 12 = <<7*12=84>>84 petals in total.\nThe daisies have 84 - 48 = <<84-48=36>>36 more petals than the orchids.\n#### 36",
    "gold_number": "36"
  },
  {
    "question": "John rents out his car 15 times a month for 4 hours each time. He gets paid $35 an hour for each rental. If his monthly car payment is $1200, how much profit does he make from renting out his car? Maybe he’s saving for a vacation!",
    "gold_full": "He rents his car for 15 x 4 = <<15*4=60>>60 hours a month.\nHe earns 60 x $35 = $<<60*35=2100>>2100 a month.\nHis profit is $2100 - $1200 = $<<2100-1200=900>>900 a month.\n#### 900",
    "gold_number": "900"
  },
  {
    "question": "Susan baked 144 cookies for a family reunion and planned to divide them equally among her 8 nieces. Before she could do so, her husband snuck 16 cookies for himself. How many cookies will each niece get? Maybe Susan will hide the cookies next time!",
    "gold_full": "After her husband takes 16 cookies, there are 144 - 16 = <<144-16=128>>128 cookies left.\nDividing 128 cookies among 8 nieces: 128 / 8 = <<128/8=16>>16 cookies per niece.\n#### 16",
    "gold_number": "16"
  },  {
    "question": "After reading glowing reviews online and grabbing popcorn at the concession stand, Deepa decided to revisit her favorite action franchise on a whim. Having braved sold-out midnight showings, she has seen all 12 of the latest blockbusters three times each on the big screen. In total, she spent $480 on tickets. What was the average price she paid per ticket? She jotted down every detail in her movie journal.",
    "gold_full": "Deepa saw 12 × 3 = <<12*3=36>>36 screenings in all.\nShe spent a total of $480, so the average price per ticket is 480 ÷ 36 = <<480/36=13.3333>>13.3333 (approximately).\n#### 13.3333",
    "gold_number": "13.3333"
  },
  {
    "question": "On a rainy afternoon, Sarah spent hours organizing her bookshelves before comparing notes with her friend. She owns 12 hardcover novels, and her friend Joseph initially had twice as many. Unfortunately, he misplaced 4 of them during a move. How many books does Joseph currently have? They plan to swap favorites afterward.",
    "gold_full": "Joseph originally had 2 × 12 = <<2*12=24>>24 books.\nAfter losing 4, he has 24 − 4 = <<24-4=20>>20 books remaining.\n#### 20",
    "gold_number": "20"
  },
  {
    "question": "While surveying their land for a new irrigation system, Farmer Brown noted the acreage carefully. His plot covers 300 acres, and Farmer Smith’s adjoining property spans 100 acres more than twice Brown’s. Combined, how many acres do the two farms occupy? They’ll share tractor equipment next season.",
    "gold_full": "Farmer Smith’s acreage: 2 × 300 + 100 = <<2*300+100=700>>700 acres.\nTotal combined acreage: 300 + 700 = <<300+700=1000>>1000 acres.\n#### 1000",
    "gold_number": "1000"
  },
  {
    "question": "During a cross-country trip, Jon keeps meticulous records of his maintenance schedule. His car requires a tune-up every 1,200 miles, and he drives 150 miles each day for a 40-day stretch. How many tune-ups will he need in that period? He logs each appointment in his planner.",
    "gold_full": "Total miles driven: 150 × 40 = <<150*40=6000>>6000 miles.\nTune-ups required: 6000 ÷ 1200 = <<6000/1200=5>>5 tune-ups.\n#### 5",
    "gold_number": "5"
  },
  {
    "question": "Bruce punched in at the factory time clock and worked 6 hours on Tuesday before grabbing dinner with colleagues. The next day he doubled his effort, and on Thursday he trimmed 3 hours off Wednesday’s shift. How many total hours did Bruce put in over those three days? He later rewarded himself with a movie night.",
    "gold_full": "Wednesday hours: 2 × 6 = <<2*6=12>>12 hours.\nThursday hours: 12 − 3 = <<12-3=9>>9 hours.\nTotal for three days: 6 + 12 + 9 = <<6+12+9=27>>27 hours.\n#### 27",
    "gold_number": "27"
  },
  {
    "question": "While stocking up for a weekend picnic, Kira picked out 5 crisp apples, 8 ripe bananas, and 10 juicy oranges. After unloading, her roommate Lola nibbled on 4 pieces before dinner. How many pieces of fruit remain? They later made smoothies together.",
    "gold_full": "Total fruit purchased: 5 + 8 + 10 = <<5+8+10=23>>23 pieces.\nAfter Lola ate 4: 23 − 4 = <<23-4=19>>19 pieces left.\n#### 19",
    "gold_number": "19"
  },
  {
    "question": "An early-morning baker slices a fresh loaf into 48 pieces before the sun comes up. Each day, Abby enjoys 2 slices with her coffee, and Josh devours twice as many. How many days will the loaf last before it’s gone? They punch in at the bakery by 4 AM.",
    "gold_full": "Josh eats 2 × 2 = <<2*2=4>>4 slices per day.\nCombined daily consumption: 2 + 4 = <<2+4=6>>6 slices.\nDays the loaf lasts: 48 ÷ 6 = <<48/6=8>>8 days.\n#### 8",
    "gold_number": "8"
  },
  {
    "question": "Planning a weekend getaway, a charter bus rolls at a steady 90 mph for 8 hours straight. Meanwhile, a rental car cruises at 60 mph for 9 hours on the same route. How many more miles did the bus cover than the car? The passengers compare notes afterward.",
    "gold_full": "Bus distance: 90 × 8 = <<90*8=720>>720 miles.\nCar distance: 60 × 9 = <<60*9=540>>540 miles.\nDifference: 720 − 540 = <<720-540=180>>180 miles.\n#### 180",
    "gold_number": "180"
  },
  {
    "question": "On Children’s Day, five schools converged on the stadium to perform synchronized drills for the visiting dignitary. Each school arranged 10 students per row across 9 rows. What is the total number of children participating? Afterwards, they’ll join a communal picnic.",
    "gold_full": "Participants per school: 10 × 9 = <<10*9=90>>90 students.\nTotal across five schools: 90 × 5 = <<90*5=450>>450 students.\n#### 450",
    "gold_number": "450"
  },
  {
    "question": "During arts and crafts hour, Jasmine was awarded 20 shiny stickers for her creative effort but accidentally lost 8 while hopping between tables. Impressed by her helpfulness, the teacher then handed her another 10 stickers. How many stickers does Jasmine have in the end? She sticks them proudly on her notebook.",
    "gold_full": "After losing stickers: 20 − 8 = <<20-8=12>>12 stickers.\nAfter teacher’s gift: 12 + 10 = <<12+10=22>>22 stickers.\n#### 22",
    "gold_number": "22"
  },
  {
    "question": "On a sunny afternoon at the botanical gardens, Marcus and Leo compared birthdays while Deanna relaxed nearby with a sketchbook. Marcus is five years younger than Deanna, who is 46 years old, and he’s exactly half as old as Leo. How old is Leo? They snapped a selfie to remember the day.",
    "gold_full": "Marcus is 46 − 5 = <<46-5=41>>41 years old.\nLeo is twice Marcus’s age: 41 × 2 = <<41*2=82>>82 years old.\n#### 82",
    "gold_number": "82"
  },
  {
    "question": "During a weekend power outage, you noticed how thick your favorite novel felt in your hands. The book’s pages stack at a density of 200 sheets per inch, and it’s printed on both sides. If the spine measures 2.5 inches, how many pages are in the book? You marked your place with a scrap of paper.",
    "gold_full": "Number of sheets: 2.5 × 200 = <<2.5*200=500>>500 sheets of paper.\nSince each sheet has 2 pages: 500 × 2 = <<500*2=1000>>1000 pages total.\n#### 1000",
    "gold_number": "1000"
  },
  {
    "question": "At the county fair’s family booth, Shawna juggled cotton candy while Aliya played nearby. Shawna is three times as old as Aliya, who just turned 6, and her father is five times her age. How old is Shawna’s father? They both posed for a souvenir photo.",
    "gold_full": "Shawna’s age: 6 × 3 = <<6*3=18>>18 years.\nHer father’s age: 18 × 5 = <<18*5=90>>90 years.\n#### 90",
    "gold_number": "90"
  },
  {
    "question": "Planning a multi-country backpacking expedition, Jen packed maps and journals before doing the math. She spent $1200 on supplies, and the cost of travel tickets was 50% more than that. What was her total trip expense, combining supplies and tickets? She logged every receipt in her travel diary.",
    "gold_full": "Additional ticket cost: 1200 × 0.5 = <<1200*0.5=600>>600 dollars.\nTicket cost: 1200 + 600 = <<1200+600=1800>>1800 dollars.\nTotal expense: 1200 + 1800 = <<1200+1800=3000>>3000 dollars.\n#### 3000",
    "gold_number": "3000"
  },
  {
    "question": "After adjusting his new surround-sound system and topping up on popcorn, John queued up a binge-worthy series. Each episode runs 30 minutes, and there are half as many episodes as the episode length in minutes. If he plans to watch the entire show straight through, how many minutes will he spend? He paused only for snack refills.",
    "gold_full": "Number of episodes: 30 ÷ 2 = <<30/2=15>>15 episodes.\nTotal watch time: 15 × 30 = <<15*30=450>>450 minutes.\n#### 450",
    "gold_number": "450"
  },
  {
    "question": "On a crisp Saturday morning, Carlton’s basketball and Zeke’s baseball teams shared the same practice field. Carlton’s squad has 23 players, and Zeke’s roster counts 7 more. How many athletes are on both teams combined? They high-fived afterward.",
    "gold_full": "Zeke’s team size: 23 + 7 = <<23+7=30>>30 players.\nTotal players: 23 + 30 = <<23+30=53>>53 athletes.\n#### 53",
    "gold_number": "53"
  },
  {
    "question": "Robert sketched his garden layout on a napkin before heading to the lumber yard. He needs to build a fence around a 25-foot by 15-foot rectangle, using 2 wooden slats per foot. How many slats must he purchase? He marked each cut line on the wood pieces.",
    "gold_full": "Perimeter: 2×25 + 2×15 = <<2*25+2*15=80>>80 feet of fencing.\nSlats needed: 80 × 2 = <<80*2=160>>160 wooden slats.\n#### 160",
    "gold_number": "160"
  },
  {
    "question": "Adrianne’s art teacher handed her 30 gleaming metallic beads to kick off a bracelet workshop. Later, her sister surprised her with 10 more beads than the teacher gave, and her friend contributed twice the teacher’s amount. How many beads does Adrianne have in total? She sorted them by color before stringing.",
    "gold_full": "Sister’s gift: 30 + 10 = <<30+10=40>>40 beads.\nFriend’s gift: 30 × 2 = <<30*2=60>>60 beads.\nTotal beads: 30 + 40 + 60 = <<30+40+60=130>>130 beads.\n#### 130",
    "gold_number": "130"
  },
  {
    "question": "After trying on half a dozen pairs of shoes at the mall, Sophie slipped into her favorite size 7 boots. Her friend Charlie prefers a style five times larger in size number. What is the average boot size between the two of them? They compared fit ratings afterward.",
    "gold_full": "Charlie’s boot size: 7 × 5 = <<7*5=35>>35.\nAverage size: (7 + 35) ÷ 2 = <<(7+35)/2=21>>21.\n#### 21",
    "gold_number": "21"
  },
  {
    "question": "During a late-night star party, Bill’s father spotted a comet when he was 32 years old. Bill caught sight of the same comet again at an age three times his father’s at the first sighting. If that comet only returns every 80 years, how old was Bill when he saw it for the first time? He recorded the event in his telescope logbook.",
    "gold_full": "Bill’s age at second sighting: 32 × 3 = <<32*3=96>>96 years.\nSubtract the 80-year orbit: 96 − 80 = <<96-80=16>>16 years old at his first sighting.\n#### 16",
    "gold_number": "16"
  },
  {
    "question": "John enjoys gardening and has a small banana grove behind his house. On Monday, he picks 8 bananas. On Tuesday, he picks 12 bananas. On Wednesday, he picks four times the number of bananas he did on Monday. How many bananas does John have in total? Maybe he’ll make banana bread or share them with friends!",
    "gold_full": "Adding Monday and Tuesday: 8 + 12 = <<8+12=20>>20 bananas.\nOn Wednesday, he picks 4 x 8 = <<4*8=32>>32 bananas.\nAltogether, John has 20 + 32 = <<20+32=52>>52 bananas.\n#### 52",
    "gold_number": "52"
  },
  {
    "question": "Tom recently bought a luxury bedroom set for $6000. He sold his old bedroom furniture for $2000 and used that money to help pay for the new set. The remaining balance is subject to a 12% monthly payment plan. How much does Tom have to pay per month? Maybe he’s planning to redecorate his whole house!",
    "gold_full": "Tom pays $6000 - $2000 = $<<6000-2000=4000>>4000 after selling his old set.\nHis monthly payment is 12% of $4000: 0.12 x $4000 = $<<0.12*4000=480>>480 per month.\n#### 480",
    "gold_number": "480"
  },
  {
    "question": "There are fifty apples in each crate at the farmers market. Uncle Franky ordered four crates of apples for his bakery. He plans to pack the apples with ten apples in each bag. How many bags of apples can he make with the four crates? Maybe he’ll use them to bake pies and tarts for the weekend crowd.",
    "gold_full": "There are 4 x 50 = <<4*50=200>>200 apples in four crates.\nHe can make 200 / 10 = <<200/10=20>>20 bags of apples.\n#### 20",
    "gold_number": "20"
  },
  {
    "question": "Leo is a sticker collector and keeps a detailed log of his collection. Three years ago, he had 220 stickers. Two years ago, he collected 80 stickers. Last year, he collected twice as many stickers as the previous year. How many stickers does Leo have now? Maybe he’ll trade some with his friends!",
    "gold_full": "Two years ago, Leo had 220 + 80 = <<220+80=300>>300 stickers.\nLast year, he collected 2 x 80 = <<2*80=160>>160 stickers.\nTotal: 300 + 160 = <<300+160=460>>460 stickers.\n#### 460",
    "gold_number": "460"
  },
  {
    "question": "Becky, Jake, and Silvia had a pizza party with 6 pizzas, each cut into 10 slices. Becky ate 5 more slices than Jake did, and Silvia ate three times as many slices as Jake did. If Becky ate 14 slices, how many total slices did they eat? Maybe they’ll need to order more pizza next time!",
    "gold_full": "Jake ate 14 - 5 = <<14-5=9>>9 slices.\nSilvia ate 9 x 3 = <<9*3=27>>27 slices.\nTotal eaten: 14 + 9 + 27 = <<14+9+27=50>>50 slices.\n#### 50",
    "gold_number": "50"
  },
  {
    "question": "James works in a busy office and receives 120 emails per day. 25% of these emails don’t require any response, but he replies to the rest. How many emails does James respond to in a 6-day work week? Maybe he needs a vacation from his inbox!",
    "gold_full": "25% of 120 is 0.25 x 120 = <<0.25*120=30>>30 emails don't need a response.\nHe responds to 120 - 30 = <<120-30=90>>90 emails per day.\nIn 6 days: 90 x 6 = <<90*6=540>>540 emails.\n#### 540",
    "gold_number": "540"
  },
  {
    "question": "Teddy enjoys puzzles and recently finished half of a 1000-piece puzzle, then started and completed another 1000-piece puzzle in one evening. How many puzzle pieces did Teddy place during that evening? Maybe he’ll frame his favorite puzzle when he’s done.",
    "gold_full": "Half of 1000 is 1000 / 2 = <<1000/2=500>>500 pieces.\nHe completed another 1000-piece puzzle: 500 + 1000 = <<500+1000=1500>>1500 pieces.\n#### 1500",
    "gold_number": "1500"
  },
  {
    "question": "Frankie and Binkie went bowling on Saturday night. Frankie’s score was 25 more than triple Binkie’s score. If Binkie bowled a score of 120, what was Frankie’s score? Maybe they’ll have a rematch next week!",
    "gold_full": "Triple Binkie's score: 3 x 120 = <<3*120=360>>360.\nFrankie's score: 360 + 25 = <<360+25=385>>385.\n#### 385",
    "gold_number": "385"
  },
  {
    "question": "An apple orchard sells apples in bags of 12. The orchard sold a total of 3600 apples on a busy Saturday. How much did the orchard earn if each bag sold for $8? Maybe they’ll use the profits for new equipment!",
    "gold_full": "Number of bags: 3600 / 12 = <<3600/12=300>>300 bags.\nEarnings: 300 x $8 = $<<300*8=2400>>2400.\n#### 2400",
    "gold_number": "2400"
  },
  {
    "question": "A Tyrannosaurus rex devoured half of a large triceratops. Afterward, a pack of velociraptors scavenged half of what was left. Finally, a group of Allosaurus finished off the last 400 kilograms of meat. How many kilograms of meat were on the triceratops before the T-Rex ate? Imagine the prehistoric feast!",
    "gold_full": "The Allosaurus ate the last half, so the velociraptors left 2 x 400 = <<2*400=800>>800 kg.\nThe T-Rex ate half, so the original amount was 2 x 800 = <<2*800=1600>>1600 kg.\n#### 1600",
    "gold_number": "1600"
  },
  {
    "question": "Jeff is the oldest of his siblings and loves organizing family reunions. He is 18 years older than his younger sister, Martha, who recently started college. Martha, on the other hand, is 9 years younger than her boyfriend, Mike, who just got promoted at work. If Mike is now 41 years old and they are planning a big trip together next summer, how old is Jeff? Imagine all of them celebrating together at a fancy restaurant.",
    "gold_full": "Martha is 41 - 9 = <<41-9=32>>32 years old.\nJeff is 32 + 18 = <<32+18=50>>50 years old.\n#### 50",
    "gold_number": "50"
  },
  {
    "question": "At the famous AquaWorld waterpark, the longest waterslide is 720 feet long, and people zoom down at a speed of 90 feet per minute. The second longest slide is 540 feet long, but it is much steeper, so people slide down at 180 feet per minute. How much longer does it take to ride the longest slide compared to the second longest slide? After a long day at the park, everyone gathers for ice cream and shares stories of their favorite rides.",
    "gold_full": "Longest slide: 720 / 90 = <<720/90=8>>8 minutes.\nSecond longest slide: 540 / 180 = <<540/180=3>>3 minutes.\nDifference: 8 - 3 = <<8-3=5>>5 minutes longer.\n#### 5",
    "gold_number": "5"
  },
  {
    "question": "Caroline is five times older than Ben, and Ben is four times older than Chris. Chris just celebrated his 7th birthday with a big party and lots of cake. If all three are planning a road trip together, how old is Caroline now? Maybe they’ll stop at every amusement park along the way!",
    "gold_full": "Ben is 7 x 4 = <<7*4=28>>28 years old.\nCaroline is 28 x 5 = <<28*5=140>>140 years old.\n#### 140",
    "gold_number": "140"
  },
  {
    "question": "Marty is preparing decorations for a school festival. He has a 360-centimeter ribbon that he needs to cut into 6 equal parts for banners. Each part must then be divided into 9 equal strips for the tables. How long will each final strip be? After the festival, Marty plans to use any leftover ribbon for a craft project with his friends.",
    "gold_full": "First, 360 / 6 = <<360/6=60>>60 cm per part.\nEach part is divided into 9 strips: 60 / 9 = <<60/9=6.666...>>6.666... cm per strip.\n#### 6.666...",
    "gold_number": "6.666..."
  },
  {
    "question": "My mom recently renovated her backyard. She bought a set of planters for $54 and three large sacks of potting soil for $39 each. At checkout, she used a coupon for $25 off her entire purchase. How much did she spend at the home improvement store? Maybe she’ll use the savings to buy new garden lights.",
    "gold_full": "Cost of planters: $54.\nCost of soil: 3 x $39 = $<<3*39=117>>117.\nTotal before coupon: $54 + $117 = $<<54+117=171>>171.\nAfter coupon: $171 - $25 = $<<171-25=146>>146.\n#### 146",
    "gold_number": "146"
  },
  {
    "question": "Last year, there were 200 students enrolled in the advanced art class at the community center. This year, enrollment increased by 35% because of a popular new instructor. How many students are enrolled this year in the art class? Maybe they’ll need to move to a larger studio next semester!",
    "gold_full": "Increase: 200 x 0.35 = <<200*0.35=70>>70 students.\nTotal this year: 200 + 70 = <<200+70=270>>270 students.\n#### 270",
    "gold_number": "270"
  },
  {
    "question": "In 15 days, Sofie will walk four times as far as Brian. If Sofie plans to walk 18 miles every day, how many miles will Brian walk in 15 days? Maybe they’ll both sign up for a marathon after this challenge!",
    "gold_full": "Sofie: 18 x 15 = <<18*15=270>>270 miles in 15 days.\nBrian: 270 / 4 = <<270/4=67.5>>67.5 miles in 15 days.\n#### 67.5",
    "gold_number": "67.5"
  },
  {
    "question": "Alfie, the legendary albatross, is on a world tour. He flies 750 kilometers every day. If the circumference of the earth is 75,000 kilometers, how many days will it take Alfie to fly a distance equal to two-fifths of the way around the earth? Maybe Alfie will set a new record for the longest flight!",
    "gold_full": "Two-fifths of 75,000 km is 75,000 x 2 / 5 = <<75000*2/5=30000>>30,000 km.\nAt 750 km per day: 30,000 / 750 = <<30000/750=40>>40 days.\n#### 40",
    "gold_number": "40"
  },
  {
    "question": "Liam is 30 years old now and just started a new job. Six years ago, Liam’s age was four times the age of Vince. How old is Vince now? Maybe they’ll celebrate with a weekend trip if they solve this riddle!",
    "gold_full": "Liam’s age six years ago: 30 - 6 = <<30-6=24>>24 years.\nVince’s age then: 24 / 4 = <<24/4=6>>6 years.\nVince now: 6 + 6 = <<6+6=12>>12 years old.\n#### 12",
    "gold_number": "12"
  },
  {
    "question": "Tim has a small orchard with 12 lemon trees. Each year, he collects 22 lemons from each tree. How many lemons will he harvest in 15 years? Maybe Tim will open a lemonade stand with his harvest!",
    "gold_full": "Each year: 12 x 22 = <<12*22=264>>264 lemons.\nIn 15 years: 264 x 15 = <<264*15=3960>>3960 lemons.\n#### 3960",
    "gold_number": "3960"
  },
  {
    "question": "While tending her greenhouse and humming a favorite tune, Patricia counted her vibrant roses and realized she originally nurtured 150 blossoms. That afternoon, she handed 120 of them to her mother as a surprise gift. Later, she stopped by the flower market and purchased 80 more roses. How many roses does she have now? She plans to arrange them in a tall vase by the window.",
    "gold_full": "Patricia had 150 − 120 = <<150-120=30>>30 roses after gifting her mother.\nTherefore, she has 30 + 80 = <<30+80=110>>110 roses now.\n#### 110",
    "gold_number": "110"
  },
  {
    "question": "After browsing a retro music shop and chatting with the collector behind the counter, John picked up a vintage cassette featuring two lengthy tracks. The first track runs 16 minutes, and the second is 75% longer in duration. If he listens to both back-to-back, how many minutes does the cassette play? He popped it into his Walkman to test.",
    "gold_full": "The second track is 16 × 0.75 = <<16*0.75=12>>12 minutes longer than the first.\nSo the second track is 16 + 12 = <<16+12=28>>28 minutes long.\nTotal cassette time: 16 + 28 = <<16+28=44>>44 minutes.\n#### 44",
    "gold_number": "44"
  },
  {
    "question": "Waiting in line at the café and doodling on his notepad, Jack checked his wallet and saw $400. His friend Sophia then surprised him by handing over one-fourth of her own $300 tip from a busy barista shift. How much money does Jack have now? He pocketed the extra cash with a grin.",
    "gold_full": "Sophia gave Jack 300 ÷ 4 = <<300/4=75>>75 dollars.\nJack’s new total: 400 + 75 = <<400+75=475>>475 dollars.\n#### 475",
    "gold_number": "475"
  },
  {
    "question": "After restocking his skincare kit and sharing a laugh with the pharmacist, Mike purchased 12 disposable face masks. His coworker Johnny, ever the overachiever, bought 7 more than four times Mike’s count. How many face masks did Johnny buy? They then donned their masks for a playful photoshoot.",
    "gold_full": "Four times Mike’s masks: 12 × 4 = <<12*4=48>>48.\nJohnny bought 48 + 7 = <<48+7=55>>55 face masks.\n#### 55",
    "gold_number": "55"
  },
  {
    "question": "Before his morning coffee, Sam laced up his running shoes and set out on Monday, Wednesday, and Friday for 4 miles each day. On Tuesday and Thursday, he pushed harder and completed 7 miles per run. How many miles did Sam run in total that week? He tracked every route on his fitness app.",
    "gold_full": "On Monday, Wednesday, and Friday: 3 × 4 = <<3*4=12>>12 miles.\nOn Tuesday and Thursday: 2 × 7 = <<2*7=14>>14 miles.\nTotal for the week: 12 + 14 = <<12+14=26>>26 miles.\n#### 26",
    "gold_number": "26"
  },
  {
    "question": "While coordinating her pack of five energetic dogs for a morning outing, Bernie noted that one dog needs 2 miles of walking per day, another needs 6 miles, the third needs 5 miles, and the fourth requires 4 miles. If, on average, each dog should walk 6 miles daily, how many miles must the fifth dog cover? She adjusts her route accordingly.",
    "gold_full": "Total miles for 5 dogs: 5 × 6 = <<5*6=30>>30 miles.\nSum for the first four: 2 + 6 + 5 + 4 = <<2+6+5+4=17>>17 miles.\nFifth dog’s miles: 30 − 17 = <<30-17=13>>13 miles.\n#### 13",
    "gold_number": "13"
  },
  {
    "question": "While juggling conference calls and playtime, Jordan looked at his three diaper-wearing toddlers, each needing 8 diaper changes daily. His wife takes care of one-third of all changes. How many diaper changes does Jordan handle each day? He plans his schedule around their routines.",
    "gold_full": "Total diaper changes: 3 × 8 = <<3*8=24>>24 per day.\nWife’s share: 24 × (1/3) = <<24*(1/3)=8>>8 changes.\nJordan’s share: 24 − 8 = <<24-8=16>>16 changes per day.\n#### 16",
    "gold_number": "16"
  },
  {
    "question": "Inspecting a sturdy oak beam in his workshop, Ian measured its full length at 90 feet. He planned a cut where one segment would be five times as long as the other shorter segment. How long will the longer piece be once he makes the cut? He jotted down the measurements before sawing.",
    "gold_full": "Let x = shorter piece length.\nThen longer piece = 5x, so x + 5x = 90 ⇒ 6x = 90 ⇒ x = <<90/6=15>>15 feet.\nLonger piece: 5 × 15 = <<5*15=75>>75 feet.\n#### 75",
    "gold_number": "75"
  },
  {
    "question": "Preparing for the neighborhood block party and testing his secret seasoning blend, Aiden plans to roll 160 meatballs. His recipe yields 20 meatballs per pound of ground beef, and he uses 3 tablespoons of seasoning for each pound. How many tablespoons of seasoning does he need in total? He pre-measured the blend in small bowls.",
    "gold_full": "Pounds of meat needed: 160 ÷ 20 = <<160/20=8>>8 pounds.\nSeasoning required: 8 × 3 = <<8*3=24>>24 tablespoons.\n#### 24",
    "gold_number": "24"
  },
  {
    "question": "Measuring for his newly renovated living room draperies while sipping a cup of tea, Luke counted eight windows, each spanning 60 inches in width. He wants to purchase fabric equal to 2.5 times the combined width for adequate fullness. How many inches of fabric should he buy? He notes it down on his planner.",
    "gold_full": "Combined window width: 8 × 60 = <<8*60=480>>480 inches.\nFabric needed: 480 × 2.5 = <<480*2.5=1200>>1200 inches.\n#### 1200",
    "gold_number": "1200"
  },
  {
    "question": "Over the past week, the city experienced some of the heaviest rainfall in years, leading to flooding in several neighborhoods. On Monday, meteorologists recorded 14 inches of rain, which caused traffic delays and school closures. According to the forecast, Tuesday is expected to bring even more rain-specifically, 1 inch more than double Monday’s total. Residents are preparing sandbags and checking their basements for leaks. How many inches of rain will there be on Tuesday if the forecast is correct?",
    "gold_full": "Twice as much rain as Monday is 14 x 2 = <<14*2=28>>28 inches.\nTuesday's rain is 28 + 1 = <<28+1=29>>29 inches.\n#### 29",
    "gold_number": "29"
  },
  {
    "question": "Eve has a massive orchard with 120 pomelos that she harvested on a sunny Saturday morning. She decided to share her bounty with friends and family. After giving away a generous portion to her neighbor and her cousin, Eve is left with only 1/8 of the pomelos she originally picked. She plans to use the remaining pomelos to make marmalade and fresh juice for a weekend brunch. How many pomelos did Eve give away?",
    "gold_full": "Eve is left with 120 x 1/8 = <<120*1/8=15>>15 pomelos.\nShe gave away 120 - 15 = <<120-15=105>>105 pomelos.\n#### 105",
    "gold_number": "105"
  },
  {
    "question": "Last Friday, during a record-breaking flu season, 38 of the 250 teachers at Riverside Academy called in sick. The school quickly arranged for 27 substitute teachers to help cover the classes. With school spirit week in full swing, the students were excited to meet the new substitutes. How many teachers were present at the school that day, including both regular and substitute teachers?",
    "gold_full": "Regular teachers present: 250 - 38 = <<250-38=212>>212.\nTotal teachers present: 212 + 27 = <<212+27=239>>239 teachers.\n#### 239",
    "gold_number": "239"
  },
  {
    "question": "Mitchell is preparing for his family’s annual movie marathon night. He buys five large bags of chips, each containing 88 chips. His extended family, including cousins and grandparents, will all be there-ten people in total. If everyone gets the same number of chips and no chips are left over, how many chips does each person get? Maybe they’ll vote for their favorite dip, too!",
    "gold_full": "Total chips: 5 x 88 = <<5*88=440>>440 chips.\nEach person gets 440 / 10 = <<440/10=44>>44 chips.\n#### 44",
    "gold_number": "44"
  },
  {
    "question": "Bob is building a giant replica of a famous bridge for his engineering club’s annual competition. He needs 288 popsicle sticks, which come 16 to a box and cost $4.50 per box. Bob’s friends are helping him paint the sticks different colors. How much will it cost Bob to buy enough sticks for his project?",
    "gold_full": "Boxes needed: 288 / 16 = <<288/16=18>>18 boxes.\nTotal cost: 18 x $4.50 = $<<18*4.5=81.00>>81.00.\n#### 81",
    "gold_number": "81"
  },
  {
    "question": "Mia and Emma are sisters who are currently 34 years apart in age. Mia, the younger sister, just celebrated her 68th birthday with a big family reunion. Emma, who lives in another country, is planning to visit soon. What is the average of their ages? Maybe they’ll go on a cruise to celebrate together!",
    "gold_full": "Emma is 68 + 34 = <<68+34=102>>102 years old.\nSum of ages: 68 + 102 = <<68+102=170>>170.\nAverage age: 170 / 2 = <<170/2=85>>85 years.\n#### 85",
    "gold_number": "85"
  },
  {
    "question": "Steve spent 24 hours over the course of a week assembling a massive 10,000-piece jigsaw puzzle for a national contest. Anna, his best friend, completed the same puzzle in 5 hours more than half of Steve’s total time. They both plan to display their completed puzzles at the local library. How long did it take Anna to finish the challenging puzzle?",
    "gold_full": "Half of Steve’s time: 24 / 2 = <<24/2=12>>12 hours.\nAnna’s time: 12 + 5 = <<12+5=17>>17 hours.\n#### 17",
    "gold_number": "17"
  },
  {
    "question": "Timothy is organizing a massive school supply drive. He has six times as many pens as George, and Sarah has three-quarters as many pens as Timothy. If George has 42 pens, how many pens does Sarah have? The school plans to donate the supplies to students in need.",
    "gold_full": "Timothy has 42 x 6 = <<42*6=252>>252 pens.\nSarah has 252 x 3/4 = <<252*3/4=189>>189 pens.\n#### 189",
    "gold_number": "189"
  },
  {
    "question": "Norman High School enrolls an average of 8,000 students every year, making it one of the largest in the state. Butler High School, the neighboring school, enrolls an average of 7/10 as many students as Norman. Both schools compete in sports and academics. How much greater is Norman’s average enrollment than Butler’s?",
    "gold_full": "Butler’s enrollment: 8,000 x 7/10 = <<8000*7/10=5600>>5600 students.\nDifference: 8,000 - 5,600 = <<8000-5600=2400>>2400 students.\n#### 2400",
    "gold_number": "2400"
  },
  {
    "question": "James is assembling 12 banquet tables for a wedding reception. Each table has 6 legs, and each leg needs 4 screws. He has a box of 350 screws. After assembling all the tables, how many screws will James have left over? The leftover screws will be saved for future projects.",
    "gold_full": "Each table needs 6 x 4 = <<6*4=24>>24 screws.\nTotal screws needed: 12 x 24 = <<12*24=288>>288 screws.\nLeftover screws: 350 - 288 = <<350-288=62>>62 screws.\n#### 62",
    "gold_number": "62"
  },
  {
    "question": "If there are 28 eggs in a basket, and there are four times as many eggs in a second basket, how many eggs are in both baskets put together? Maybe someone will bake dozens of cakes for the village fair!",
    "gold_full": "Second basket: 28 x 4 = <<28*4=112>>112 eggs.\nTotal eggs: 28 + 112 = <<28+112=140>>140 eggs.\n#### 140",
    "gold_number": "140"
  },
  {
    "question": "After a spontaneous match of beach volleyball and browsing the boardwalk arcade, Henry and five of his friends decided to order a feast. They requested 15 extra-large pizzas for lunch, each pie sliced into 12 equal pieces. If the entire group wants to share the pizzas equally, how many slices does each person receive? They plan to use any leftover slices for a late-afternoon snack.",
    "gold_full": "Total slices: 15 × 12 = <<15*12=180>>180 slices.\nPeople sharing: 1 (Henry) + 5 friends = <<1+5=6>>6 people.\nSlices per person: 180 ÷ 6 = <<180/6=30>>30 slices each.\n#### 30",
    "gold_number": "30"
  }
]